docs/howto/async.org
#+TITLE: Asynchronous Methods
#+LANGUAGE:  en
#+OPTIONS: H:2 author:nil creator:nil
#+HTML_HEAD_EXTRA: <script type="text/javascript" src="hotdrink.min.js"></script>
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="style.css"/>

#+BEGIN_HTML
<div style="border: 1px solid #600; background: #fee; color: #600; padding: 1em">
!!! This tutorial is still being updated for version 2.1.  Please check back later.
</div>
#+END_HTML

* Asynchronous concepts

** Asynchronous execution

When methods are executed /synchronously/ it means that they are run
one after another, and that each method must complete before the next method
can begin.  This can be problematic if a
method takes a long time to finish --- e.g., a method which needs to make a
request to a server.  Such methods, if run synchronously, can cause the
interface to "hang" or become unresponsive.

When methods are executed /asynchronously/, the system does not wait for them
to finish, but instead resumes normal operation while methods continue to run.
Methods begin execution as soon as their inputs are ready and signal when they
are completed.  In this way, the interface remains responsive even when
methods take a long time to execute.

Note that, in order to be useful, an asynchronous method requires some way of
executing code "in the background" so that it does not tie up the main
event-handling thread.  JavaScript provides several mechanisms in support of
this.  For example, [[https://developer.mozilla.org/en-US/docs/AJAX][AJAX]] allows asynchronous server requests, and [[https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage][web workers]]
allow JavaScript to run on a different thread.  HotDrink is designed to work
regardless of which mechanism you use for asynchronous code execution (though
it does provide some light-weight wrappers to facilitate simple AJAX and web
worker tasks --- see Sections [[Helper: AJAX requests]] and [[Helper: web workers]]).
This gives you the freedom to make use of whatever mechanism you wish to
implement your methods.

** Promises

A /promise/ represents a value that will be supplied later.  Promises are a
common programming idiom for asynchronous programming.  HotDrink promises
follow the [[https://promisesaplus.com/][Promises/A+]] specification --- an open standard for interoperable
JavaScript promises.  There are many good sources of documentation on using
promises in JavaScript, therefore, we show only the basics here.

#+BEGIN_SRC js -n -r
// "p" is a new promise
var p = new hd.Promise(); (ref:newpromise)

// Schedule function "f1" to be called with the value of "p" once it's ready
// Returns a promise for the result of "f1" which we store in "q"
var q = p.then( (ref:then)
  function f1( v ) {
    return v + 10;
  }
);

// Schedule function "f2" to be called with the value of "q" once it's ready
// This, too, returns a promise, but we ignore it
//   (we're not interested in the result of f2)
q.then( (ref:then2)
  function f2( w ) {
    console.log( 'Value: ' + w );
  }
);

// Give "p" a value
p.resolve( 17 ); (ref:resolve)

// This causes "f1" to be called with 17 as the argument...
//   ...which returns 27...
//   ...which resolves promise "q"...
//   ...which causes "f2" to be called with 27 as the argument...
//   ...resulting in "Value: 27" being printed to the log
#+END_SRC

Using promises involves three steps.

1. Create a new promise object.  This is a simple construction using the ~new~
   operator, as shown in [[(newpromise)][line (newpromise)]].
2. Register one or more functions to be executed once the promise has been
   given a value.  (We call this /scheduling/ the functions.)  This is done
   using the ~then~ function, as shown in [[(then)][line (then)]].  When you schedule a
   function, you get back a promise for the result of that function.  In this
   way you can chain together asynchronous calculations --- the value produced
   by one will be passed to the next.  You can see this on [[(then2)][line (then2)]] where
   we schedule ~f2~ to be run using the result of ~f1~.
3. Resolve the promise with a value.  This is done using the ~resolve~
   function, as shown in [[(resolve)][line (resolve)]].

/Note:  It is not required that you give names to functions you schedule for
promises; we only did so to make it easier to refer to them in other places./

* Asynchronous methods

