howto/async.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Asynchronous Methods</title>
<!-- 2015-10-29 Thu 10:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Asynchronous Methods</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Asynchronous concepts</a>
<ul>
<li><a href="#sec-1-1">1.1. Asynchronous execution</a></li>
<li><a href="#sec-1-2">1.2. Promises</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Asynchronous methods</a>
<ul>
<li><a href="#sec-2-1">2.1. The example</a></li>
<li><a href="#sec-2-2">2.2. Activations and activating functions</a></li>
<li><a href="#sec-2-3">2.3. Pending variables</a></li>
<li><a href="#sec-2-4">2.4. Caveat</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Lifting functions</a>
<ul>
<li><a href="#sec-3-1">3.1. The example</a></li>
<li><a href="#sec-3-2">3.2. Using <code>liftFunction</code></a></li>
<li><a href="#sec-3-3">3.3. The truth about "ordinary" methods</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Partial lifting: returning promises</a>
<ul>
<li><a href="#sec-4-1">4.1. The example</a></li>
<li><a href="#sec-4-2">4.2. A promise for a promise</a></li>
<li><a href="#sec-4-3">4.3. Coordinating promises</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Partial lifting: promise parameters</a>
<ul>
<li><a href="#sec-5-1">5.1. The example</a></li>
<li><a href="#sec-5-2">5.2. Requesting input promises</a></li>
<li><a href="#sec-5-3">5.3. Output variables</a></li>
<li><a href="#sec-5-4">5.4. Contributing and relevant</a></li>
<li><a href="#sec-5-5">5.5. Automatic disabling</a></li>
<li><a href="#sec-5-6">5.6. Explicit control over usage</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Helper: AJAX requests</a>
<ul>
<li><a href="#sec-6-1">6.1. The example</a></li>
<li><a href="#sec-6-2">6.2. Simple AJAX wrappers</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Helper: web workers</a>
<ul>
<li><a href="#sec-7-1">7.1. The example</a></li>
<li><a href="#sec-7-2">7.2. Simple web worker wrapper</a></li>
<li><a href="#sec-7-3">7.3. Security restrictions</a></li>
<li><a href="#sec-7-4">7.4. Worker pools</a></li>
<li><a href="#sec-7-5">7.5. Killing workers</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div style="border: 1px solid #600; background: #fee; color: #600; padding: 1em">
!!! This tutorial is still being updated for version 2.1.  Please check back later.
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Asynchronous concepts</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Asynchronous execution</h3>
<div class="outline-text-3" id="text-1-1">
<p>
When methods are executed <i>synchronously</i> it means that they are run
one after another, and that each method must complete before the next method
can begin.  This can be problematic if a
method takes a long time to finish &#x2014; e.g., a method which needs to make a
request to a server.  Such methods, if run synchronously, can cause the
interface to "hang" or become unresponsive.
</p>

<p>
When methods are executed <i>asynchronously</i>, the system does not wait for them
to finish, but instead resumes normal operation while methods continue to run.
Methods begin execution as soon as their inputs are ready and signal when they
are completed.  In this way, the interface remains responsive even when
methods take a long time to execute.
</p>

<p>
Note that, in order to be useful, an asynchronous method requires some way of
executing code "in the background" so that it does not tie up the main
event-handling thread.  JavaScript provides several mechanisms in support of
this.  For example, <a href="https://developer.mozilla.org/en-US/docs/AJAX">AJAX</a> allows asynchronous server requests, and <a href="https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API/basic_usage">web workers</a>
allow JavaScript to run on a different thread.  HotDrink is designed to work
regardless of which mechanism you use for asynchronous code execution (though
it does provide some light-weight wrappers to facilitate simple AJAX and web
worker tasks &#x2014; see Sections <a href="#sec-6">6</a> and <a href="#sec-7">7</a>).
This gives you the freedom to make use of whatever mechanism you wish to
implement your methods.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Promises</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A <i>promise</i> represents a value that will be supplied later.  Promises are a
common programming idiom for asynchronous programming.  HotDrink promises
follow the <a href="https://promisesaplus.com/">Promises/A+</a> specification &#x2014; an open standard for interoperable
JavaScript promises.  There are many good sources of documentation on using
promises in JavaScript, therefore, we show only the basics here.
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">"p" is a new promise</span>
<span id="coderef-newpromise" class="coderef-off"><span class="linenr"> 2: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">p</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Promise</span>();</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Schedule function "f1" to be called with the value of "p" once it's ready</span>
<span class="linenr"> 5: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Returns a promise for the result of "f1" which we store in "q"</span>
<span id="coderef-then" class="coderef-off"><span class="linenr"> 6: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">q</span> = p.then(</span>
<span class="linenr"> 7: </span>  <span style="color: #0000FF;">function</span> <span style="color: #006699;">f1</span>( <span style="color: #BA36A5;">v</span> ) {
<span class="linenr"> 8: </span>    <span style="color: #0000FF;">return</span> v + 10;
<span class="linenr"> 9: </span>  }
<span class="linenr">10: </span>);
<span class="linenr">11: </span>
<span class="linenr">12: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Schedule function "f2" to be called with the value of "q" once it's ready</span>
<span class="linenr">13: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">This, too, returns a promise, but we ignore it</span>
<span class="linenr">14: </span><span style="color: #8D8D84;">//   </span><span style="color: #8D8D84; font-style: italic;">(we're not interested in the result of f2)</span>
<span id="coderef-then2" class="coderef-off"><span class="linenr">15: </span>q.then(</span>
<span class="linenr">16: </span>  <span style="color: #0000FF;">function</span> <span style="color: #006699;">f2</span>( <span style="color: #BA36A5;">w</span> ) {
<span class="linenr">17: </span>    console.log( <span style="color: #008000;">'Value: '</span> + w );
<span class="linenr">18: </span>  }
<span class="linenr">19: </span>);
<span class="linenr">20: </span>
<span class="linenr">21: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Give "p" a value</span>
<span id="coderef-resolve" class="coderef-off"><span class="linenr">22: </span>p.resolve( 17 );</span>
<span class="linenr">23: </span>
<span class="linenr">24: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">This causes "f1" to be called with 17 as the argument...</span>
<span class="linenr">25: </span><span style="color: #8D8D84;">//   </span><span style="color: #8D8D84; font-style: italic;">...which returns 27...</span>
<span class="linenr">26: </span><span style="color: #8D8D84;">//   </span><span style="color: #8D8D84; font-style: italic;">...which resolves promise "q"...</span>
<span class="linenr">27: </span><span style="color: #8D8D84;">//   </span><span style="color: #8D8D84; font-style: italic;">...which causes "f2" to be called with 27 as the argument...</span>
<span class="linenr">28: </span><span style="color: #8D8D84;">//   </span><span style="color: #8D8D84; font-style: italic;">...resulting in "Value: 27" being printed to the log</span>
</pre>
</div>

<p>
Using promises involves three steps.
</p>

<ol class="org-ol">
<li>Create a new promise object.  This is a simple construction using the <code>new</code>
   operator, as shown in <a href="#coderef-newpromise"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-newpromise');" onmouseout="CodeHighlightOff(this, 'coderef-newpromise');">line 2</a>.
</li>
<li>Register one or more functions to be executed once the promise has been
given a value.  (We call this <i>scheduling</i> the functions.)  This is done
using the <code>then</code> function, as shown in <a href="#coderef-then"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-then');" onmouseout="CodeHighlightOff(this, 'coderef-then');">line 6</a>.  When you schedule a
function, you get back a promise for the result of that function.  In this
way you can chain together asynchronous calculations &#x2014; the value produced
by one will be passed to the next.  You can see this on <a href="#coderef-then2"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-then2');" onmouseout="CodeHighlightOff(this, 'coderef-then2');">line 15</a> where
we schedule <code>f2</code> to be run using the result of <code>f1</code>.
</li>
<li>Resolve the promise with a value.  This is done using the <code>resolve</code>
   function, as shown in <a href="#coderef-resolve"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-resolve');" onmouseout="CodeHighlightOff(this, 'coderef-resolve');">line 22</a>.
</li>
</ol>

<p>
<i>Note:  It is not required that you give names to functions you schedule for
promises; we only did so to make it easier to refer to them in other places.</i>
</p>
</div>
</div>
</div>
