docs/howto/async.org
** The example

/View/

#+BEGIN_SRC html -n -r :exports code :tangle tangle/timer.html :padline no
<div id="ex1" style="display:inline-block; text-align:right">
  <style type="text/css" scoped>
    .pending { background: right center no-repeat url(spinner.gif); }
  </style>
  Total Cost: <input type="text" data-bind="hd.numVar( total, 2 )"/><br/> (ref:numvar)
  Tip Percentage: <input type="text" data-bind="hd.numVar( percent, 0 )"/><br/>
  Tip: <input type="text" data-bind="hd.numVar( tip, 2 )" readonly/>
</div>
#+END_SRC

/View-Model/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/timer.js :padline no
var model = new hd.ModelBuilder()
  .vs( 'total, percent, tip', {total: 50, percent: 20} )

  .c( 'total, percent, tip' )
  .asyncMethod( 'total, percent -> tip', function( pTotal, pPercent ) { (ref:fn)
    var pTip = new hd.Promise();  (ref:mkprom)

    pTotal.then( function f1( total ) { (ref:waitx)
      pPercent.then( function f2( percent ) { (ref:waity)
        setTimeout( function() { pTip.resolve( total * percent / 100 ); }, 3000 ); (ref:resz)
      } );
    } );

    return pTip; (ref:retz)
  } )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
#+END_SRC

/Binding/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/timer.js :padline no
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex1' ) );
} )
#+END_SRC

/Result/

#+HTML: <div class="results">
#+INCLUDE: tangle/timer.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/timer.js html
#+HTML: })();
#+HTML: </script>

/Notes/

#+HTML: <div class="notes">
This example implements a simple tip calculator.  If you modify the cost or the
percentage, you will notice that there is a delay in calculating the tip.  We
used an asynchronous method to allow the user interface to remain responsive
even during this delay.

Because the code for this asynchronous method is a little bulky, we have
written only a single method for our constraint.  (That's why you cannot edit
the tip directly:  the only option for solving the constraint is to calculate
the tip.)  Later we will see how to make the code for asynchronous methods
more compact.
#+HTML: </div>

