howto/async.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Asynchronous methods</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The example</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<i>View</i>
</p>

<div class="org-src-container">

<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex1"</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"display:inline-block; text-align:right"</span>&gt;
<span class="linenr">2: </span>  &lt;<span style="color: #006699;">style</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/css"</span> scoped&gt;
<span class="linenr">3: </span>    .pending { background: right center no-repeat url(spinner.gif); }
<span class="linenr">4: </span>  &lt;/<span style="color: #006699;">style</span>&gt;
<span id="coderef-numvar" class="coderef-off"><span class="linenr">5: </span>  Total Cost: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( total, 2 )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;</span>
<span class="linenr">6: </span>  Tip Percentage: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( percent, 0 )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">7: </span>  Tip: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( tip, 2 )"</span> readonly/&gt;
<span class="linenr">8: </span>&lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<p>
<i>View-Model</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
<span class="linenr"> 2: </span>  .vs( <span style="color: #008000;">'total, percent, tip'</span>, {total: 50, percent: 20} )
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>  .c( <span style="color: #008000;">'total, percent, tip'</span> )
<span id="coderef-fn" class="coderef-off"><span class="linenr"> 5: </span>  .asyncMethod( <span style="color: #008000;">'total, percent -&gt; tip'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">pTotal</span>, <span style="color: #BA36A5;">pPercent</span> ) {</span>
<span id="coderef-mkprom" class="coderef-off"><span class="linenr"> 6: </span>    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">pTip</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Promise</span>();</span>
<span class="linenr"> 7: </span>
<span id="coderef-waitx" class="coderef-off"><span class="linenr"> 8: </span>    pTotal.then( <span style="color: #0000FF;">function</span> f1( <span style="color: #BA36A5;">total</span> ) {</span>
<span id="coderef-waity" class="coderef-off"><span class="linenr"> 9: </span>      pPercent.then( <span style="color: #0000FF;">function</span> f2( <span style="color: #BA36A5;">percent</span> ) {</span>
<span id="coderef-resz" class="coderef-off"><span class="linenr">10: </span>        setTimeout( <span style="color: #0000FF;">function</span>() { pTip.resolve( total * percent / 100 ); }, 3000 );</span>
<span class="linenr">11: </span>      } );
<span class="linenr">12: </span>    } );
<span class="linenr">13: </span>
<span id="coderef-retz" class="coderef-off"><span class="linenr">14: </span>    <span style="color: #0000FF;">return</span> pTip;</span>
<span class="linenr">15: </span>  } )
<span class="linenr">16: </span>
<span class="linenr">17: </span>  .end();
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">system</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ConstraintSystem</span>();
<span class="linenr">20: </span>system.addComponent( model );
</pre>
</div>

<p>
<i>Binding</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">2: </span>  hd.performDeclaredBindings( model, document.getElementById( <span style="color: #008000;">'ex1'</span> ) );
<span class="linenr">3: </span>} )
</pre>
</div>

<p>
<i>Result</i>
</p>

<div class="results">
<div id="ex1" style="display:inline-block; text-align:right">
  <style type="text/css" scoped>
    .pending { background: right center no-repeat url(spinner.gif); }
  </style>
  Total Cost: <input type="text" data-bind="hd.numVar( total, 2 )"/><br/> 
  Tip Percentage: <input type="text" data-bind="hd.numVar( percent, 0 )"/><br/>
  Tip: <input type="text" data-bind="hd.numVar( tip, 2 )" readonly/>
</div>
</div>
<script type="text/javascript">
(function() {
var model = new hd.ModelBuilder()
  .vs( 'total, percent, tip', {total: 50, percent: 20} )

  .c( 'total, percent, tip' )
  .asyncMethod( 'total, percent -> tip', function( pTotal, pPercent ) { 
    var pTip = new hd.Promise();  

    pTotal.then( function f1( total ) { 
      pPercent.then( function f2( percent ) { 
        setTimeout( function() { pTip.resolve( total * percent / 100 ); }, 3000 ); 
      } );
    } );

    return pTip; 
  } )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex1' ) );
} )
})();
</script>

<p>
<i>Notes</i>
</p>

<div class="notes">
<p>
This example implements a simple tip calculator.  If you modify the cost or the
percentage, you will notice that there is a delay in calculating the tip.  We
used an asynchronous method to allow the user interface to remain responsive
even during this delay.
</p>

<p>
Because the code for this asynchronous method is a little bulky, we have
written only a single method for our constraint.  (That's why you cannot edit
the tip directly:  the only option for solving the constraint is to calculate
the tip.)  Later we will see how to make the code for asynchronous methods
more compact.
</p>
</div>
</div>
</div>
