docs/howto/async.org
** Activations and activating functions

We refer to a single execution of a method as an /activation/ of that method.
The activation of a synchronous method corresponds to a single function call.
For asynchronous methods this is no longer the case: the activation of an
asynchronous method may involve multiple callback functions running in
response to things such as Ajax calls, web workers, etc.  However, there must
still be one single function which initiates the activation and which tells us
how to get the results when it is finished.  We call this function the
/activating function/ for the method.

We can create an asynchronous method using the ~asyncMethod~ member function
of the model builder.  (Note that, as with other builder member functions, we
can abbreviate this as simply ~a~.)  The parameter to ~asyncMethod~ is the
activating function for the method.

Whereas the functions for synchronous methods take the values of input
variables as parameters and return new values for output variables, activating
functions take /promises/ for the values of input variables as parameters, and
return /promises/ for new values for output variables.  Thus, the activating
function for the method "~total, percent -> tip~" (on [[(fn)][line (fn)]] of the
view-model) takes two parameters: a promise for the value of ~total~ and a
promise for the value of ~percent~; and it returns a promise for a new value
of ~tip~.

In general, then, an activating function should behave as follows:

1. Take input promises as parameters.  Note that, on [[(fn)][line (fn)]] of the
   view-model source, we named our parameters $pTotal$ and $pPercent$ to
   remind us that these are promises, not values.
2. Create promise(s) for the outputs of the method.  You can see this on
   [[(mkprom)][line (mkprom)]] of the view-model source.
3. Schedule a function or functions to be run once the input promises have
   been resolved; these functions should compute values for the output
   promises.  You can see this in the view-model source.  We start by
   scheduling $f1$ to run when $x$ is ready ([[(waitx)][line (waitx)]]); $f1$ will schedule
   $f2$ to run when $y$ is ready ([[(waity)][line (waity)]]); and $f2$ will calculate the
   result and resolve the promise we made for $z$ ([[(resz)][line (resz)]]).  In order to
   make the delay noticeable, we use a three-second timer to resolve $z$
   instead of resolving right away.
4. Return the output promise(s).  You can see this on [[(retz)][line (retz)]] of the
   view-model source.  As with ordinary methods, if there is more
   than one output you should return an array of promises.

To reiterate, the activating function itself is /not/ asynchronous.  Any
function is inherently synchronous: once you start it, you must wait for it to
finish.  Your activating function should /not/ take long to run, or else the
system will hang.  However, the purpose of the activating function is /not/ to
perform the work of the method; rather, its purpose is to /schedule/ the work
so that it will proceed on its own once the inputs are ready.  (In our example
it is function $f2$ where the actual work of the method is performed.)

** Pending variables

Every variable has a read-only Boolean property named ~pending~.  This
property is true when the variable's value is scheduled to be changed once a
promise has been resolved.  The suggested use for this variable is with a CSS
binding (e.g., the ~hd.bindCssClass~ binder) to give some sort of visual
indication that this variable will be updated soon.

The ~hd.numVar~ factory function we use, e.g., on [[(numvar)][line (numvar)]] of the view,
creates a binding which adds the ~pending~ CSS class to an element when the
variable's ~pending~ property is true, and adds the ~complete~ CSS class when
it is false.  We refer to this in the CSS block on [[(css)][line (css)]] of the view to
show a spinner when the variable is pending.

For more information on binding specifications, see the [[file:binding.org][Advanced Binding
Concepts]] document.

# ** Helper: ~Promise.all~

# As you can see from the example, waiting for several promises to resolve may
# result in several nested calls to ~then~, resulting in code that is difficult
# to read.  The ~hd.Promise.all~ function is a helper function which can make
# this type of code cleaner.

# The ~hd.Promise.all~ function takes multiple promises and returns a single
# promise.  Once all the input promises have been resolved, the output promise
# will be resolved with a single array containing the values of all the input
# promises.  Thus, we could rewrite the function on [[(fn)][line (fn)]] of the view-model
# source as follows.

# #+BEGIN_SRC js -n -r
# function( pTotal, pPercent ) {
#   var z = new hd.Promise();
#   hd.Promise.all( pTotal, pPercent ).then( function( vals ) {
#     setTimeout( function() { z.resolve( vals[0] * vals[1] / 100 ); }, 3000 );
#   } );
# }
# #+END_SRC

** Caveat

There are some subtleties to writing your own asynchronous method that are
beyond the scope of this document.  (We will discuss them later in our
[[file:program.org][Programming Guide]].)  Thus, for the time being, we suggest you use HotDrink's
function lifting mechanism to create activating functions for asynchronous
methods.  We'll talk about that next.

* Lifting functions

