howto/async.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Activations and activating functions</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We refer to a single execution of a method as an <i>activation</i> of that method.
The activation of a synchronous method corresponds to a single function call.
For asynchronous methods this is no longer the case: the activation of an
asynchronous method may involve multiple callback functions running in
response to things such as Ajax calls, web workers, etc.  However, there must
still be one single function which initiates the activation and which tells us
how to get the results when it is finished.  We call this function the
<i>activating function</i> for the method.
</p>

<p>
We can create an asynchronous method using the <code>asyncMethod</code> member function
of the model builder.  (Note that, as with other builder member functions, we
can abbreviate this as simply <code>a</code>.)  The parameter to <code>asyncMethod</code> is the
activating function for the method.
</p>

<p>
Whereas the functions for synchronous methods take the values of input
variables as parameters and return new values for output variables, activating
functions take <i>promises</i> for the values of input variables as parameters, and
return <i>promises</i> for new values for output variables.  Thus, the activating
function for the method "<code>total, percent -&gt; tip</code>" (on <a href="#coderef-fn"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-fn');" onmouseout="CodeHighlightOff(this, 'coderef-fn');">line 5</a> of the
view-model) takes two parameters: a promise for the value of <code>total</code> and a
promise for the value of <code>percent</code>; and it returns a promise for a new value
of <code>tip</code>.
</p>

<p>
In general, then, an activating function should behave as follows:
</p>

<ol class="org-ol">
<li>Take input promises as parameters.  Note that, on <a href="#coderef-fn"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-fn');" onmouseout="CodeHighlightOff(this, 'coderef-fn');">line 5</a> of the
view-model source, we named our parameters \(pTotal\) and \(pPercent\) to
remind us that these are promises, not values.
</li>
<li>Create promise(s) for the outputs of the method.  You can see this on
<a href="#coderef-mkprom"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-mkprom');" onmouseout="CodeHighlightOff(this, 'coderef-mkprom');">line 6</a> of the view-model source.
</li>
<li>Schedule a function or functions to be run once the input promises have
been resolved; these functions should compute values for the output
promises.  You can see this in the view-model source.  We start by
scheduling \(f1\) to run when \(x\) is ready (<a href="#coderef-waitx"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-waitx');" onmouseout="CodeHighlightOff(this, 'coderef-waitx');">line 8</a>); \(f1\) will schedule
\(f2\) to run when \(y\) is ready (<a href="#coderef-waity"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-waity');" onmouseout="CodeHighlightOff(this, 'coderef-waity');">line 9</a>); and \(f2\) will calculate the
result and resolve the promise we made for \(z\) (<a href="#coderef-resz"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-resz');" onmouseout="CodeHighlightOff(this, 'coderef-resz');">line 10</a>).  In order to
make the delay noticeable, we use a three-second timer to resolve \(z\)
instead of resolving right away.
</li>
<li>Return the output promise(s).  You can see this on <a href="#coderef-retz"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-retz');" onmouseout="CodeHighlightOff(this, 'coderef-retz');">line 14</a> of the
view-model source.  As with ordinary methods, if there is more
than one output you should return an array of promises.
</li>
</ol>

<p>
To reiterate, the activating function itself is <i>not</i> asynchronous.  Any
function is inherently synchronous: once you start it, you must wait for it to
finish.  Your activating function should <i>not</i> take long to run, or else the
system will hang.  However, the purpose of the activating function is <i>not</i> to
perform the work of the method; rather, its purpose is to <i>schedule</i> the work
so that it will proceed on its own once the inputs are ready.  (In our example
it is function \(f2\) where the actual work of the method is performed.)
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Pending variables</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Every variable has a read-only Boolean property named <code>pending</code>.  This
property is true when the variable's value is scheduled to be changed once a
promise has been resolved.  The suggested use for this variable is with a CSS
binding (e.g., the <code>hd.bindCssClass</code> binder) to give some sort of visual
indication that this variable will be updated soon.
</p>

<p>
The <code>hd.numVar</code> factory function we use, e.g., on <a href="#coderef-numvar"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-numvar');" onmouseout="CodeHighlightOff(this, 'coderef-numvar');">line 5</a> of the view,
creates a binding which adds the <code>pending</code> CSS class to an element when the
variable's <code>pending</code> property is true, and adds the <code>complete</code> CSS class when
it is false.  We refer to this in the CSS block on <a href="#coderef-css"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-css');" onmouseout="CodeHighlightOff(this, 'coderef-css');">line 2</a> of the view to
show a spinner when the variable is pending.
</p>

<p>
For more information on binding specifications, see the <a href="binding.html">Advanced Binding
Concepts</a> document.
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Caveat</h3>
<div class="outline-text-3" id="text-2-4">
<p>
There are some subtleties to writing your own asynchronous method that are
beyond the scope of this document.  (We will discuss them later in our
<a href="program.html">Programming Guide</a>.)  Thus, for the time being, we suggest you use HotDrink's
function lifting mechanism to create activating functions for asynchronous
methods.  We'll talk about that next.
</p>
</div>
</div>
</div>
