docs/howto/async.org
** The example

/View/

#+BEGIN_SRC html -n -r :exports code :tangle tangle/div.html :padline no
<div id="ex2" style="display:inline-block; text-align:right">
  Dividend: <input type="text" data-bind="hd.numVar( n, 0 )"/><br/>
  Divisor: <input type="text" data-bind="hd.numVar( d, 0 )"/><br/>
  Quotient: <input type="text" data-bind="hd.numVar( q, 0 )"/><br/>
  Remainder: <input type="text" data-bind="hd.numVar( r, 0 )"/>
</div>
#+END_SRC

/View-Model/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/div.js :padline no
function divideRemainder( n, d ) {
  return [Math.floor( n / d ), n % d];
}

function multiplyRemainder( d, q, r ) {
  return q*d + r;
}


var model = new hd.ModelBuilder()
  .vs( 'n, d, q, r', {n: 50, q: 6} )

  .c( 'n, d, q, r' )
  .a( 'n, d -> q, r', hd.liftFunction( divideRemainder, 2 ) ) (ref:out1)
  .a( 'n, q -> d, r', hd.liftFunction( divideRemainder, 2 ) ) (ref:out2)
  .a( 'd, q, r -> n', hd.liftFunction( multiplyRemainder ) )  (ref:out3)

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
#+END_SRC

/Binding/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/div.js :padline no
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex2' ) );
} )
#+END_SRC

/Result/

#+HTML: <div class="results">
#+INCLUDE: tangle/div.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/div.js html
#+HTML: })();
#+HTML: </script>

/Notes/

#+HTML: <div class="notes">
Notice that all methods in this example are created as asynchronous methods.
However, rather than writing our own activating functions, we lifted functions
which operate on values.
#+HTML: </div>

** Using ~liftFunction~

The purpose of ~liftFunction~ is to transform a function which operates on
values into a function which operates on promises.  Thus, the parameter for
~liftFunction~ is a function which takes values and returns values, and the
return value is a function which takes promises and returns promises.  This
lifted function behaves as follows.

1. Takes input promises as parameters.
2. Creates output promises.
3. Schedules a function to be run once all input promises are resolved.  This
   function will pass the input values to the original function (which was
   passed to ~liftFunction~) and use the result to resolve the output promises.
4. Returns the output promises.

Note that such a function works perfectly as an activating function for an
asynchronous method.  Thus, in effect, ~liftFunction~ can turn a synchronous
method into an asynchronous method.

The lifted function does not need to know ahead of time how many inputs to
pass to the original function: it simply passes as many inputs as it receives
promises.  However, it /does/ need to know how many outputs the original
function will return ahead of time: it must create output promises before it
can examine the output of the original function.  By default, ~liftFunction~
creates a lifted function which has only one output.  If your lifted function
will have more than one output, you must provide the number of outputs as the
second parameter to ~liftFunction~; you can see this on [[(out1)][line (out1)]] and [[(out2)][line
(out2)]] of the view-model source.


