howto/async.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Lifting functions</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> The example</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<i>View</i>
</p>

<div class="org-src-container">

<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex2"</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"display:inline-block; text-align:right"</span>&gt;
<span class="linenr">2: </span>  Dividend: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( n, 0 )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">3: </span>  Divisor: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( d, 0 )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">4: </span>  Quotient: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( q, 0 )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">5: </span>  Remainder: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( r, 0 )"</span>/&gt;
<span class="linenr">6: </span>&lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<p>
<i>View-Model</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #0000FF;">function</span> <span style="color: #006699;">divideRemainder</span>( <span style="color: #BA36A5;">n</span>, <span style="color: #BA36A5;">d</span> ) {
<span class="linenr"> 2: </span>  <span style="color: #0000FF;">return</span> [Math.floor( n / d ), n % d];
<span class="linenr"> 3: </span>}
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #0000FF;">function</span> <span style="color: #006699;">multiplyRemainder</span>( <span style="color: #BA36A5;">d</span>, <span style="color: #BA36A5;">q</span>, <span style="color: #BA36A5;">r</span> ) {
<span class="linenr"> 6: </span>  <span style="color: #0000FF;">return</span> q*d + r;
<span class="linenr"> 7: </span>}
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
<span class="linenr">11: </span>  .vs( <span style="color: #008000;">'n, d, q, r'</span>, {n: 50, q: 6} )
<span class="linenr">12: </span>
<span class="linenr">13: </span>  .c( <span style="color: #008000;">'n, d, q, r'</span> )
<span id="coderef-out1" class="coderef-off"><span class="linenr">14: </span>  .a( <span style="color: #008000;">'n, d -&gt; q, r'</span>, hd.liftFunction( divideRemainder, 2 ) )</span>
<span id="coderef-out2" class="coderef-off"><span class="linenr">15: </span>  .a( <span style="color: #008000;">'n, q -&gt; d, r'</span>, hd.liftFunction( divideRemainder, 2 ) )</span>
<span id="coderef-out3" class="coderef-off"><span class="linenr">16: </span>  .a( <span style="color: #008000;">'d, q, r -&gt; n'</span>, hd.liftFunction( multiplyRemainder ) )</span>
<span class="linenr">17: </span>
<span class="linenr">18: </span>  .end();
<span class="linenr">19: </span>
<span class="linenr">20: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">system</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ConstraintSystem</span>();
<span class="linenr">21: </span>system.addComponent( model );
</pre>
</div>

<p>
<i>Binding</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">2: </span>  hd.performDeclaredBindings( model, document.getElementById( <span style="color: #008000;">'ex2'</span> ) );
<span class="linenr">3: </span>} )
</pre>
</div>

<p>
<i>Result</i>
</p>

<div class="results">
<div id="ex2" style="display:inline-block; text-align:right">
  Dividend: <input type="text" data-bind="hd.numVar( n, 0 )"/><br/>
  Divisor: <input type="text" data-bind="hd.numVar( d, 0 )"/><br/>
  Quotient: <input type="text" data-bind="hd.numVar( q, 0 )"/><br/>
  Remainder: <input type="text" data-bind="hd.numVar( r, 0 )"/>
</div>
</div>
<script type="text/javascript">
(function() {
function divideRemainder( n, d ) {
  return [Math.floor( n / d ), n % d];
}

function multiplyRemainder( d, q, r ) {
  return q*d + r;
}


var model = new hd.ModelBuilder()
  .vs( 'n, d, q, r', {n: 50, q: 6} )

  .c( 'n, d, q, r' )
  .a( 'n, d -> q, r', hd.liftFunction( divideRemainder, 2 ) ) 
  .a( 'n, q -> d, r', hd.liftFunction( divideRemainder, 2 ) ) 
  .a( 'd, q, r -> n', hd.liftFunction( multiplyRemainder ) )  

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex2' ) );
} )
})();
</script>

<p>
<i>Notes</i>
</p>

<div class="notes">
<p>
Notice that all methods in this example are created as asynchronous methods.
However, rather than writing our own activating functions, we lifted functions
which operate on values.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Using <code>liftFunction</code></h3>
<div class="outline-text-3" id="text-3-2">
<p>
The purpose of <code>liftFunction</code> is to transform a function which operates on
values into a function which operates on promises.  Thus, the parameter for
<code>liftFunction</code> is a function which takes values and returns values, and the
return value is a function which takes promises and returns promises.  This
lifted function behaves as follows.
</p>

<ol class="org-ol">
<li>Takes input promises as parameters.
</li>
<li>Creates output promises.
</li>
<li>Schedules a function to be run once all input promises are resolved.  This
function will pass the input values to the original function (which was
passed to <code>liftFunction</code>) and use the result to resolve the output promises.
</li>
<li>Returns the output promises.
</li>
</ol>

<p>
Note that such a function works perfectly as an activating function for an
asynchronous method.  Thus, in effect, <code>liftFunction</code> can turn a synchronous
method into an asynchronous method.
</p>

<p>
The lifted function does not need to know ahead of time how many inputs to
pass to the original function: it simply passes as many inputs as it receives
promises.  However, it <i>does</i> need to know how many outputs the original
function will return ahead of time: it must create output promises before it
can examine the output of the original function.  By default, <code>liftFunction</code>
creates a lifted function which has only one output.  If your lifted function
will have more than one output, you must provide the number of outputs as the
second parameter to <code>liftFunction</code>; you can see this on <a href="#coderef-out1"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-out1');" onmouseout="CodeHighlightOff(this, 'coderef-out1');">line 14</a> and <a href="#coderef-out2"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-out2');" onmouseout="CodeHighlightOff(this, 'coderef-out2');">line
15</a> of the view-model source.
</p>
</div>
</div>
