docs/howto/async.org
** The truth about "ordinary" methods

It's time to come clean.  Up to now we've been discussing asynchronous methods
as if they were somehow different from other methods.  In fact, if you're
going to allow some methods to be asynchronous, then they must all be
asynchronous (because if one method is going to take a while to execute, then
other methods are going to have to be prepared to wait until it is done).

The truth of the matter is, /all/ methods in HotDrink are asynchronous
methods.  The only difference between creating a method with the ~method~
builder function and creating a method with the ~asyncMethod~ builder
function is that the ~method~ builder function will use ~liftFunction~ to
create an activating function for your method, whereas ~asyncMethod~ assumes
you have given it the activating function.

Thus, in the example above, we could have saved ourselves some trouble and
defined our view-model as follows.

#+BEGIN_SRC js -n -r
var model = new hd.ModelBuilder()
  .vs( 'n, d, q, r', {n: 50, q: 6} )

  .c( 'n, d, q, r' )
  .m( 'n, d -> q, r', divideRemainder )
  .m( 'n, q -> d, r', divideRemainder )
  .m( 'q, r, d -> n', multiplyRemainder )

  .end();
#+END_SRC

This produces /exactly the same/ view-model as the source in the example.
(Note that we do not need to specify the number of outputs here, as the model
builder can deduce it from the signature.)  Thus, there really is no reason to
call ~liftFunction~ directly; it is simpler just to use the ~method~
(a.k.a. ~m~) member function.

And so, we've come full circle.  It turns out we've been writing asynchronous
methods all along and didn't realize it.  However, now that we know what's
really going on with our methods, let's discuss a few tricks that we can do.

* Partial lifting: returning promises

** The example

/View/

#+BEGIN_SRC html -n -r :exports code :tangle tangle/promout.html :padline no
<div id="ex3" style="display:inline-block; text-align:right">
  <style type="text/css" scoped> (ref:css)
    .pending { background: right center no-repeat url(spinner.gif); }
  </style>
  Width: <input type="text" data-bind="hd.numVar( w )"/><br/>
  Height: <input type="text" data-bind="hd.numVar( h )"/><br/>
  Area: <input type="text" data-bind="hd.numVar( a )"/><br/>
  Perimeter: <input type="text" data-bind="hd.numVar( p )"/>
</div>
#+END_SRC

/View-Model/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/promout.js :padline no
function delayedPromise( val ) { (ref:delprom)
  var p = new hd.Promise();
  setTimeout( function() { p.resolve( val ) }, 5000 );
  return p;
}

var model = new hd.ModelBuilder()
  .vs( 'w, h, a, p', {w: 80, h: 60} )

  .c( 'w, h, a' )
  .m( 'w, h -> a', function( w, h ) { return w*h; } )
  .m( 'a, h -> w', function( a, h ) { return delayedPromise( a/h ); } )
  .m( 'a, w -> h', function( a, w ) { return delayedPromise( a/w ); } )

  .c( 'w, h, p' )
  .m( 'w, h -> p', function( w, h ) { return 2*w + 2*h; } )
  .m( 'p, h -> w', function( p, h ) { return delayedPromise( p/2 - h ); } )
  .m( 'p, w -> h', function( p, w ) { return delayedPromise( p/2 - w ); } )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
#+END_SRC

/Binding/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/promout.js :padline no
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex3' ) );
} )
#+END_SRC

/Result/

#+HTML: <div class="results">
#+INCLUDE: tangle/promout.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/promout.js html
#+HTML: })();
#+HTML: </script>

/Notes/

#+HTML: <div class="notes">
This example enforces the expected relations between the width, height, area,
and perimeter of a rectangle.  However, any calculation of width or height is
delayed by five seconds.  Note that, during this delay, you may continue to
edit values in the form.
#+HTML: </div>

