howto/async.html


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> The truth about "ordinary" methods</h3>
<div class="outline-text-3" id="text-3-3">
<p>
It's time to come clean.  Up to now we've been discussing asynchronous methods
as if they were somehow different from other methods.  In fact, if you're
going to allow some methods to be asynchronous, then they must all be
asynchronous (because if one method is going to take a while to execute, then
other methods are going to have to be prepared to wait until it is done).
</p>

<p>
The truth of the matter is, <i>all</i> methods in HotDrink are asynchronous
methods.  The only difference between creating a method with the <code>method</code>
builder function and creating a method with the <code>asyncMethod</code> builder
function is that the <code>method</code> builder function will use <code>liftFunction</code> to
create an activating function for your method, whereas <code>asyncMethod</code> assumes
you have given it the activating function.
</p>

<p>
Thus, in the example above, we could have saved ourselves some trouble and
defined our view-model as follows.
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
<span class="linenr">2: </span>  .vs( <span style="color: #008000;">'n, d, q, r'</span>, {n: 50, q: 6} )
<span class="linenr">3: </span>
<span class="linenr">4: </span>  .c( <span style="color: #008000;">'n, d, q, r'</span> )
<span class="linenr">5: </span>  .m( <span style="color: #008000;">'n, d -&gt; q, r'</span>, divideRemainder )
<span class="linenr">6: </span>  .m( <span style="color: #008000;">'n, q -&gt; d, r'</span>, divideRemainder )
<span class="linenr">7: </span>  .m( <span style="color: #008000;">'q, r, d -&gt; n'</span>, multiplyRemainder )
<span class="linenr">8: </span>
<span class="linenr">9: </span>  .end();
</pre>
</div>

<p>
This produces <i>exactly the same</i> view-model as the source in the example.
(Note that we do not need to specify the number of outputs here, as the model
builder can deduce it from the signature.)  Thus, there really is no reason to
call <code>liftFunction</code> directly; it is simpler just to use the <code>method</code>
(a.k.a. <code>m</code>) member function.
</p>

<p>
And so, we've come full circle.  It turns out we've been writing asynchronous
methods all along and didn't realize it.  However, now that we know what's
really going on with our methods, let's discuss a few tricks that we can do.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Partial lifting: returning promises</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> The example</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<i>View</i>
</p>

<div class="org-src-container">

<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex3"</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"display:inline-block; text-align:right"</span>&gt;
<span id="coderef-css" class="coderef-off"><span class="linenr">2: </span>  &lt;<span style="color: #006699;">style</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/css"</span> scoped&gt;</span>
<span class="linenr">3: </span>    .pending { background: right center no-repeat url(spinner.gif); }
<span class="linenr">4: </span>  &lt;/<span style="color: #006699;">style</span>&gt;
<span class="linenr">5: </span>  Width: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( w )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">6: </span>  Height: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( h )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">7: </span>  Area: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( a )"</span>/&gt;&lt;<span style="color: #006699;">br</span>/&gt;
<span class="linenr">8: </span>  Perimeter: &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( p )"</span>/&gt;
<span class="linenr">9: </span>&lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<p>
<i>View-Model</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span id="coderef-delprom" class="coderef-off"><span class="linenr"> 1: </span><span style="color: #0000FF;">function</span> <span style="color: #006699;">delayedPromise</span>( <span style="color: #BA36A5;">val</span> ) {</span>
<span class="linenr"> 2: </span>  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">p</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Promise</span>();
<span class="linenr"> 3: </span>  setTimeout( <span style="color: #0000FF;">function</span>() { p.resolve( val ) }, 5000 );
<span class="linenr"> 4: </span>  <span style="color: #0000FF;">return</span> p;
<span class="linenr"> 5: </span>}
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
<span class="linenr"> 8: </span>  .vs( <span style="color: #008000;">'w, h, a, p'</span>, {w: 80, h: 60} )
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  .c( <span style="color: #008000;">'w, h, a'</span> )
<span class="linenr">11: </span>  .m( <span style="color: #008000;">'w, h -&gt; a'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">w</span>, <span style="color: #BA36A5;">h</span> ) { <span style="color: #0000FF;">return</span> w*h; } )
<span class="linenr">12: </span>  .m( <span style="color: #008000;">'a, h -&gt; w'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">h</span> ) { <span style="color: #0000FF;">return</span> delayedPromise( a/h ); } )
<span class="linenr">13: </span>  .m( <span style="color: #008000;">'a, w -&gt; h'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">w</span> ) { <span style="color: #0000FF;">return</span> delayedPromise( a/w ); } )
<span class="linenr">14: </span>
<span class="linenr">15: </span>  .c( <span style="color: #008000;">'w, h, p'</span> )
<span class="linenr">16: </span>  .m( <span style="color: #008000;">'w, h -&gt; p'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">w</span>, <span style="color: #BA36A5;">h</span> ) { <span style="color: #0000FF;">return</span> 2*w + 2*h; } )
<span class="linenr">17: </span>  .m( <span style="color: #008000;">'p, h -&gt; w'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">p</span>, <span style="color: #BA36A5;">h</span> ) { <span style="color: #0000FF;">return</span> delayedPromise( p/2 - h ); } )
<span class="linenr">18: </span>  .m( <span style="color: #008000;">'p, w -&gt; h'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">p</span>, <span style="color: #BA36A5;">w</span> ) { <span style="color: #0000FF;">return</span> delayedPromise( p/2 - w ); } )
<span class="linenr">19: </span>
<span class="linenr">20: </span>  .end();
<span class="linenr">21: </span>
<span class="linenr">22: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">system</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ConstraintSystem</span>();
<span class="linenr">23: </span>system.addComponent( model );
</pre>
</div>

<p>
<i>Binding</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">2: </span>  hd.performDeclaredBindings( model, document.getElementById( <span style="color: #008000;">'ex3'</span> ) );
<span class="linenr">3: </span>} )
</pre>
</div>

<p>
<i>Result</i>
</p>

<div class="results">
<div id="ex3" style="display:inline-block; text-align:right">
  <style type="text/css" scoped> 
    .pending { background: right center no-repeat url(spinner.gif); }
  </style>
  Width: <input type="text" data-bind="hd.numVar( w )"/><br/>
  Height: <input type="text" data-bind="hd.numVar( h )"/><br/>
  Area: <input type="text" data-bind="hd.numVar( a )"/><br/>
  Perimeter: <input type="text" data-bind="hd.numVar( p )"/>
</div>
</div>
<script type="text/javascript">
(function() {
function delayedPromise( val ) { 
  var p = new hd.Promise();
  setTimeout( function() { p.resolve( val ) }, 5000 );
  return p;
}

var model = new hd.ModelBuilder()
  .vs( 'w, h, a, p', {w: 80, h: 60} )

  .c( 'w, h, a' )
  .m( 'w, h -> a', function( w, h ) { return w*h; } )
  .m( 'a, h -> w', function( a, h ) { return delayedPromise( a/h ); } )
  .m( 'a, w -> h', function( a, w ) { return delayedPromise( a/w ); } )

  .c( 'w, h, p' )
  .m( 'w, h -> p', function( w, h ) { return 2*w + 2*h; } )
  .m( 'p, h -> w', function( p, h ) { return delayedPromise( p/2 - h ); } )
  .m( 'p, w -> h', function( p, w ) { return delayedPromise( p/2 - w ); } )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex3' ) );
} )
})();
</script>

<p>
<i>Notes</i>
</p>

<div class="notes">
<p>
This example enforces the expected relations between the width, height, area,
and perimeter of a rectangle.  However, any calculation of width or height is
delayed by five seconds.  Note that, during this delay, you may continue to
edit values in the form.
</p>
</div>
</div>
</div>
