docs/howto/async.org
** A promise for a promise

Notice that all methods in the example are created using the ~method~ builder
function, and yet some of them return promises as if they were activating
functions for asynchronous methods.  How does this work?

According to the [[https://promisesaplus.com/][Promises/A+]] specification, if you resolve a promise $p$ using
a second promise $q$, the behavior is as follows: $p$ remains in a pending
state until $q$ is resolved; as soon as $q$ is resolved, then $p$ will
automatically be resolved using the same value as $q$.

Consider what this means for functions lifted with ~liftFunction~.  When you
lift a function, the return values of the original function are used to
resolve the corresponding output promises of the lifted function.  Thus, if
your original function returns a promise, that promise will be used to resolve
the corresponding output promise --- and later when you resolve that promise,
the output promise will automatically be resolved using the same value.

Thus, the function for a synchronous method --- one which will be lifted with
~liftFunction~ --- can return a promise just as an activating function can.
In both cases, the end result is the same:  whatever value eventually given to
the promise will become the output of the method.

** Coordinating promises

One common problem with implementing asynchronous behavior in a user interface
is managing edits that are made before all asynchronous calculations have
completed.  On the one hand, you don't want your interface to lock up,
refusing to allow any user input until the current calculations have complete.
But, on the other hand, you also don't want to start new calculations using
stale values which are scheduled to be updated.

Fortunately, this type of organization is completely handled for you by
HotDrink. If you play around with the example above --- rapidly making edits
to multiple fields --- you can see that the user interface remains fully
responsive even as it waits on promises to be resolved.  When an edit is made
to a HotDrink variable, HotDrink will immediately run the activating functions
for all methods which should be executed in response.  (Remember, every method
is asynchronous, so every method has a activating function.)  Later, once all
input promises have been resolved, the actual work of the method will take
place.

Perhaps a helpful analogy would be water flowing through a pipeline.  Promises
are like the pipes, defining where values will eventually be, and values are
like the water flowing through the pipes.  The activating function for an
asynchronous method constructs a small pipeline for the method: input pipes
and output pipes are connected to some calculation, creating a pipeline
suitable for conducting water at some point in the future.  HotDrink then
connects those small pipelines into one large, continuous pipeline.  New
pipelines can be added on to this, even before there is water in the pipes.
Eventually the water will flow forward, filling all the pipes; how quickly the
water comes does not affect the results.

* Partial lifting: promise parameters

