howto/async.html

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> A promise for a promise</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Notice that all methods in the example are created using the <code>method</code> builder
function, and yet some of them return promises as if they were activating
functions for asynchronous methods.  How does this work?
</p>

<p>
According to the <a href="https://promisesaplus.com/">Promises/A+</a> specification, if you resolve a promise \(p\) using
a second promise \(q\), the behavior is as follows: \(p\) remains in a pending
state until \(q\) is resolved; as soon as \(q\) is resolved, then \(p\) will
automatically be resolved using the same value as \(q\).
</p>

<p>
Consider what this means for functions lifted with <code>liftFunction</code>.  When you
lift a function, the return values of the original function are used to
resolve the corresponding output promises of the lifted function.  Thus, if
your original function returns a promise, that promise will be used to resolve
the corresponding output promise &#x2014; and later when you resolve that promise,
the output promise will automatically be resolved using the same value.
</p>

<p>
Thus, the function for a synchronous method &#x2014; one which will be lifted with
<code>liftFunction</code> &#x2014; can return a promise just as an activating function can.
In both cases, the end result is the same:  whatever value eventually given to
the promise will become the output of the method.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Coordinating promises</h3>
<div class="outline-text-3" id="text-4-3">
<p>
One common problem with implementing asynchronous behavior in a user interface
is managing edits that are made before all asynchronous calculations have
completed.  On the one hand, you don't want your interface to lock up,
refusing to allow any user input until the current calculations have complete.
But, on the other hand, you also don't want to start new calculations using
stale values which are scheduled to be updated.
</p>

<p>
Fortunately, this type of organization is completely handled for you by
HotDrink. If you play around with the example above &#x2014; rapidly making edits
to multiple fields &#x2014; you can see that the user interface remains fully
responsive even as it waits on promises to be resolved.  When an edit is made
to a HotDrink variable, HotDrink will immediately run the activating functions
for all methods which should be executed in response.  (Remember, every method
is asynchronous, so every method has a activating function.)  Later, once all
input promises have been resolved, the actual work of the method will take
place.
</p>

<p>
Perhaps a helpful analogy would be water flowing through a pipeline.  Promises
are like the pipes, defining where values will eventually be, and values are
like the water flowing through the pipes.  The activating function for an
asynchronous method constructs a small pipeline for the method: input pipes
and output pipes are connected to some calculation, creating a pipeline
suitable for conducting water at some point in the future.  HotDrink then
connects those small pipelines into one large, continuous pipeline.  New
pipelines can be added on to this, even before there is water in the pipes.
Eventually the water will flow forward, filling all the pipes; how quickly the
water comes does not affect the results.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Partial lifting: promise parameters</h2>
