docs/howto/async.org
** The example

/View/

#+BEGIN_SRC html -n -r :exports code :tangle tangle/promin.html :padline no
<div id="ex4">
  <style type="text/css" scoped> (ref:css)
    .pending { background: #eee right center no-repeat url(spinner.gif); }
  </style>
  <table>
    <tr>
      <td>Quantity:</td>
      <td><input type="text" data-bind="hd.numVar( qty, 0 )"/></td>
    </tr><tr>
      <td>Unit price:</td>
      <td><input type="text" data-bind="hd.numVar( unit, 2 )"/></td>
    </tr><tr>
      <td>Subtotal:</td>
      <td data-bind="hd.text( sub, hd.fix( 2 ) )"></td>
    </tr><tr>
      <td colspan="2"><hr/></td>
    </tr><tr>
      <td>
        <input id="shipcheck" type="checkbox" data-bind="hd.checked( doship )"/>
        <label for="shipcheck">Ship to:</label>
      </td>
      <td>
        <select data-bind="hd.value( state ), hd.enabled( state.relevant )"> (ref:enable)
          <option>Texas</option>
          <option>Oklahoma</option>
          <option>Arkansas</option>
          <option>Louisiana</option>
        </select>
      </td>
    </tr><tr>
      <td>Shipping:</td>
      <td data-bind="hd.text( ship, hd.fix( 2 ) ), hd.cssClass( ship )"></td>
    </tr><tr>
      <td colspan="2"><hr/></td>
    </tr><tr>
      <td>Total:</td>
      <td data-bind="hd.text( total, hd.fix( 2 ) ), hd.cssClass( total )"></td>
    </tr>
  </table>
</div>
#+END_SRC

/View-Model/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/promin.js :padline no
var model = new hd.ModelBuilder()
  .vs( 'qty, unit, sub, doship, state, ship',
       {qty: 4, unit: 10, doship: true, state: 'Texas'}
     )
  .outputVariable( 'total' ) (ref:output)

  .c( 'qty, unit, sub' )
  .m( 'qty, unit -> sub', function( qty, unit ) { return qty * unit; } )

  .c( 'state, qty, ship' )
  .m( 'state, qty -> ship', function( state, qty ) {
    var cost;
    switch (state) {
    case 'Texas':     cost = 1; break;
    case 'Oklahoma':  cost = 2; break;
    case 'Arkansas':  cost = 3; break;
    case 'Louisiana': cost = 2; break;
    }
    var p = new hd.Promise();
    setTimeout( function() { p.resolve( qty * cost ); }, 2000 );
    return p;
  } )

  .c( 'sub, doship, ship, total' )
  .m( 'sub, doship, *ship -> total', function f3( sub, doship, pShip ) { (ref:asterisk)
    if (doship) {
      return pShip.then( function( ship ) { (ref:then3)
        return sub + ship;
      } );
    }
    else {
      return sub;
    }
  } )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
#+END_SRC

/Binding/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/promin.js :padline no
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex4' ) );
} )
#+END_SRC

/Result/

#+HTML: <div class="results">
#+INCLUDE: tangle/promin.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/promin.js html
#+HTML: })();
#+HTML: </script>

/Notes/

#+HTML: <div class="notes">
This example simulates a lengthy calculation: for example, determining
shipping costs for an order.  In this example, shipping cost is a simple
function which we have deliberately delayed with a timer; in a more realistic
scenario, calculating shipping costs may require a call to a server resulting
in a noticeable delay.

Try editing the quantity.  Notice how behavior changes when the shipping cost
is not used: the system no longer waits for shipping cost before calculating
the total.  Furthermore, the drop-down box is disabled as it is no longer
relevant.
#+HTML: </div>

