howto/async.html
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> The example</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<i>View</i>
</p>

<div class="org-src-container">

<pre class="src src-html"><span class="linenr"> 1: </span>&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex4"</span>&gt;
<span id="coderef-css" class="coderef-off"><span class="linenr"> 2: </span>  &lt;<span style="color: #006699;">style</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/css"</span> scoped&gt;</span>
<span class="linenr"> 3: </span>    .pending { background: #eee right center no-repeat url(spinner.gif); }
<span class="linenr"> 4: </span>  &lt;/<span style="color: #006699;">style</span>&gt;
<span class="linenr"> 5: </span>  &lt;<span style="color: #006699;">table</span>&gt;
<span class="linenr"> 6: </span>    &lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr"> 7: </span>      &lt;<span style="color: #006699;">td</span>&gt;Quantity:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr"> 8: </span>      &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( qty, 0 )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr"> 9: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">10: </span>      &lt;<span style="color: #006699;">td</span>&gt;Unit price:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">11: </span>      &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( unit, 2 )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">12: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">13: </span>      &lt;<span style="color: #006699;">td</span>&gt;Subtotal:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">14: </span>      &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( sub, hd.fix( 2 ) )"</span>&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">15: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">16: </span>      &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">colspan</span>=<span style="color: #008000;">"2"</span>&gt;&lt;<span style="color: #006699;">hr</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">17: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">18: </span>      &lt;<span style="color: #006699;">td</span>&gt;
<span class="linenr">19: </span>        &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"shipcheck"</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"checkbox"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.checked( doship )"</span>/&gt;
<span class="linenr">20: </span>        &lt;<span style="color: #006699;">label</span> <span style="color: #BA36A5;">for</span>=<span style="color: #008000;">"shipcheck"</span>&gt;Ship to:&lt;/<span style="color: #006699;">label</span>&gt;
<span class="linenr">21: </span>      &lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">22: </span>      &lt;<span style="color: #006699;">td</span>&gt;
<span id="coderef-enable" class="coderef-off"><span class="linenr">23: </span>        &lt;<span style="color: #006699;">select</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.value( state ), hd.enabled( state.relevant )"</span>&gt;</span>
<span class="linenr">24: </span>          &lt;<span style="color: #006699;">option</span>&gt;Texas&lt;/<span style="color: #006699;">option</span>&gt;
<span class="linenr">25: </span>          &lt;<span style="color: #006699;">option</span>&gt;Oklahoma&lt;/<span style="color: #006699;">option</span>&gt;
<span class="linenr">26: </span>          &lt;<span style="color: #006699;">option</span>&gt;Arkansas&lt;/<span style="color: #006699;">option</span>&gt;
<span class="linenr">27: </span>          &lt;<span style="color: #006699;">option</span>&gt;Louisiana&lt;/<span style="color: #006699;">option</span>&gt;
<span class="linenr">28: </span>        &lt;/<span style="color: #006699;">select</span>&gt;
<span class="linenr">29: </span>      &lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">30: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">31: </span>      &lt;<span style="color: #006699;">td</span>&gt;Shipping:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">32: </span>      &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( ship, hd.fix( 2 ) ), hd.cssClass( ship )"</span>&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">33: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">34: </span>      &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">colspan</span>=<span style="color: #008000;">"2"</span>&gt;&lt;<span style="color: #006699;">hr</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">35: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">36: </span>      &lt;<span style="color: #006699;">td</span>&gt;Total:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">37: </span>      &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( total, hd.fix( 2 ) ), hd.cssClass( total )"</span>&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">38: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;
<span class="linenr">39: </span>  &lt;/<span style="color: #006699;">table</span>&gt;
<span class="linenr">40: </span>&lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<p>
<i>View-Model</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
<span class="linenr"> 2: </span>  .vs( <span style="color: #008000;">'qty, unit, sub, doship, state, ship'</span>,
<span class="linenr"> 3: </span>       {qty: 4, unit: 10, doship: <span style="color: #8b1a1a;">true</span>, state: <span style="color: #008000;">'Texas'</span>}
<span class="linenr"> 4: </span>     )
<span id="coderef-output" class="coderef-off"><span class="linenr"> 5: </span>  .outputVariable( <span style="color: #008000;">'total'</span> )</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  .c( <span style="color: #008000;">'qty, unit, sub'</span> )
<span class="linenr"> 8: </span>  .m( <span style="color: #008000;">'qty, unit -&gt; sub'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">qty</span>, <span style="color: #BA36A5;">unit</span> ) { <span style="color: #0000FF;">return</span> qty * unit; } )
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>  .c( <span style="color: #008000;">'state, qty, ship'</span> )
<span class="linenr">11: </span>  .m( <span style="color: #008000;">'state, qty -&gt; ship'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">state</span>, <span style="color: #BA36A5;">qty</span> ) {
<span class="linenr">12: </span>    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">cost</span>;
<span class="linenr">13: </span>    <span style="color: #0000FF;">switch</span> (state) {
<span class="linenr">14: </span>    <span style="color: #0000FF;">case</span> <span style="color: #008000;">'Texas'</span>:     cost = 1; <span style="color: #0000FF;">break</span>;
<span class="linenr">15: </span>    <span style="color: #0000FF;">case</span> <span style="color: #008000;">'Oklahoma'</span>:  cost = 2; <span style="color: #0000FF;">break</span>;
<span class="linenr">16: </span>    <span style="color: #0000FF;">case</span> <span style="color: #008000;">'Arkansas'</span>:  cost = 3; <span style="color: #0000FF;">break</span>;
<span class="linenr">17: </span>    <span style="color: #0000FF;">case</span> <span style="color: #008000;">'Louisiana'</span>: cost = 2; <span style="color: #0000FF;">break</span>;
<span class="linenr">18: </span>    }
<span class="linenr">19: </span>    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">p</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Promise</span>();
<span class="linenr">20: </span>    setTimeout( <span style="color: #0000FF;">function</span>() { p.resolve( qty * cost ); }, 2000 );
<span class="linenr">21: </span>    <span style="color: #0000FF;">return</span> p;
<span class="linenr">22: </span>  } )
<span class="linenr">23: </span>
<span class="linenr">24: </span>  .c( <span style="color: #008000;">'sub, doship, ship, total'</span> )
<span id="coderef-asterisk" class="coderef-off"><span class="linenr">25: </span>  .m( <span style="color: #008000;">'sub, doship, *ship -&gt; total'</span>, <span style="color: #0000FF;">function</span> f3( <span style="color: #BA36A5;">sub</span>, <span style="color: #BA36A5;">doship</span>, <span style="color: #BA36A5;">pShip</span> ) {</span>
<span class="linenr">26: </span>    <span style="color: #0000FF;">if</span> (doship) {
<span id="coderef-then3" class="coderef-off"><span class="linenr">27: </span>      <span style="color: #0000FF;">return</span> pShip.then( <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">ship</span> ) {</span>
<span class="linenr">28: </span>        <span style="color: #0000FF;">return</span> sub + ship;
<span class="linenr">29: </span>      } );
<span class="linenr">30: </span>    }
<span class="linenr">31: </span>    <span style="color: #0000FF;">else</span> {
<span class="linenr">32: </span>      <span style="color: #0000FF;">return</span> sub;
<span class="linenr">33: </span>    }
<span class="linenr">34: </span>  } )
<span class="linenr">35: </span>
<span class="linenr">36: </span>  .end();
<span class="linenr">37: </span>
<span class="linenr">38: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">system</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ConstraintSystem</span>();
<span class="linenr">39: </span>system.addComponent( model );
</pre>
</div>

<p>
<i>Binding</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">2: </span>  hd.performDeclaredBindings( model, document.getElementById( <span style="color: #008000;">'ex4'</span> ) );
<span class="linenr">3: </span>} )
</pre>
</div>

<p>
<i>Result</i>
</p>

<div class="results">
<div id="ex4">
  <style type="text/css" scoped> 
    .pending { background: #eee right center no-repeat url(spinner.gif); }
  </style>
  <table>
    <tr>
      <td>Quantity:</td>
      <td><input type="text" data-bind="hd.numVar( qty, 0 )"/></td>
    </tr><tr>
      <td>Unit price:</td>
      <td><input type="text" data-bind="hd.numVar( unit, 2 )"/></td>
    </tr><tr>
      <td>Subtotal:</td>
      <td data-bind="hd.text( sub, hd.fix( 2 ) )"></td>
    </tr><tr>
      <td colspan="2"><hr/></td>
    </tr><tr>
      <td>
        <input id="shipcheck" type="checkbox" data-bind="hd.checked( doship )"/>
        <label for="shipcheck">Ship to:</label>
      </td>
      <td>
        <select data-bind="hd.value( state ), hd.enabled( state.relevant )"> 
          <option>Texas</option>
          <option>Oklahoma</option>
          <option>Arkansas</option>
          <option>Louisiana</option>
        </select>
      </td>
    </tr><tr>
      <td>Shipping:</td>
      <td data-bind="hd.text( ship, hd.fix( 2 ) ), hd.cssClass( ship )"></td>
    </tr><tr>
      <td colspan="2"><hr/></td>
    </tr><tr>
      <td>Total:</td>
      <td data-bind="hd.text( total, hd.fix( 2 ) ), hd.cssClass( total )"></td>
    </tr>
  </table>
</div>
</div>
<script type="text/javascript">
(function() {
var model = new hd.ModelBuilder()
  .vs( 'qty, unit, sub, doship, state, ship',
       {qty: 4, unit: 10, doship: true, state: 'Texas'}
     )
  .outputVariable( 'total' ) 

  .c( 'qty, unit, sub' )
  .m( 'qty, unit -> sub', function( qty, unit ) { return qty * unit; } )

  .c( 'state, qty, ship' )
  .m( 'state, qty -> ship', function( state, qty ) {
    var cost;
    switch (state) {
    case 'Texas':     cost = 1; break;
    case 'Oklahoma':  cost = 2; break;
    case 'Arkansas':  cost = 3; break;
    case 'Louisiana': cost = 2; break;
    }
    var p = new hd.Promise();
    setTimeout( function() { p.resolve( qty * cost ); }, 2000 );
    return p;
  } )

  .c( 'sub, doship, ship, total' )
  .m( 'sub, doship, *ship -> total', function f3( sub, doship, pShip ) { 
    if (doship) {
      return pShip.then( function( ship ) { 
        return sub + ship;
      } );
    }
    else {
      return sub;
    }
  } )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex4' ) );
} )
})();
</script>

<p>
<i>Notes</i>
</p>

<div class="notes">
<p>
This example simulates a lengthy calculation: for example, determining
shipping costs for an order.  In this example, shipping cost is a simple
function which we have deliberately delayed with a timer; in a more realistic
scenario, calculating shipping costs may require a call to a server resulting
in a noticeable delay.
</p>

<p>
Try editing the quantity.  Notice how behavior changes when the shipping cost
is not used: the system no longer waits for shipping cost before calculating
the total.  Furthermore, the drop-down box is disabled as it is no longer
relevant.
</p>
</div>
</div>
</div>
