docs/howto/async.org
** Requesting input promises

In some cases you may want your method to wait on all but one or two input
promises.  In such cases, you can request that the function lifting mechanism
pass to your function, not the /value/ of the promise, but the promise itself.
This allows you to decide if and when you will wait on this promise.

The full signature of ~liftFunction~ is as follows.  Note that the last two
parameters are optional.

#+HTML: <div class="notes">
~liftFunction( fn, numOutputs, promiseMask )~
#+HTML: </div>

We explained the first two parameters in Section [[* Lifting functions]].  The
final parameter, if provided, should be an array of Boolean values, one for
each parameter, where ~true~ means to pass the corresponding parameter's
promise directly, and ~false~ means to wait for the corresponding parameter's
promise to resolve and pass its value.

However, as we mentioned earlier, there's really no reason to call
~liftFunction~ directly; you should simply use the ~method~ builder member function
which calls ~liftFunction~ for you.  To indicate to the model builder that you
want to recieve a promise for a parameter, you place an asterisk ("~*~") in
front of the parameter name in the method signature.  You can see this in the
method declared in [[(asterisk)][line (asterisk)]] of the view-model.

If you decide you need this parameter, you must use it's ~then~ method to schedule a
function to be run when its value is ready.  On [[(then3)][line (then3)]] of the view-model
we schedule a function to calculate the total using the shipping cost as soon
as it is ready.  Remember that the return value for the ~then~ function is a
promise for the return value of the function we scheduled.  We return this
as the promise for the output of our method.

Observe what happens if the checkbox for ~doship~ is unchecked: Since ~doship~
is false, we do not subscribe to the promise for ~ship~.  Since we do not
subscribe to that promise, we do not have to wait for it to be ready.  Thus,
we can calculate the total cost before the shipping cost is even ready.  This is
convenient when the calculation for shipping cost is so slow.

** Output variables

Typically the purpose of a user interface is to allow the user to enter values
for variables that will be used elsewhere in the program --- e.g., in the
/model/.  (If you don't know what that is, see [[file:intro.org][Introduction to HotDrink]]
for an explanation of MVVM.)  We refer to these variables as /output/
variables.

It is possible that a user interface contains some additional variables ---
variables which are not used elsewhere in the program, but are there to help
the user calculate other variables which are.  We refer to these variables as
/interface/ variables.

By default, HotDrink considers all variables as interface variables.  If this
is not the case, then you will need to explicitly tell HotDrink which ones
are.  You can change a single variable to an output variable using the
~outputVariable~ member function (abbreviated ~ov~), or change a list of
variables to output variables using the ~outputVariables~ member function
(abbreviated ~ovs~).  Similarly, you can change a single variable to an
interface variable using the ~outputVariable~ member function (abbreviated
~ov~), or change a list of variables to interface variables using the
~outputVariables~ member function (abbreviated ~ovs~).

The parameter for these functions is the name, or a comma-delimited list of
the names, to be changed.  For example:

#+BEGIN_SRC js
builder.outputVariable( 'x' );

builder.interfaceVariables( 'x, y, z' );
#+END_SRC

As a convenience for you, these functions are overloaded so that, if there is
no variable with the name given, they will create one first.  Just as with the
~variable~ and ~variables~ builder functions, you may specify an initial value
for the variables as well.  Thus, on [[(output)][line (output)]] of the
view-model we both create a new variable named "output" and also mark the
variable as an output variable.

** Contributing and relevant

There is another advantage to taking an input promise when you might not need
its value: HotDrink can tell if a promise was never subscribed to, and can
conclude that the corresponding input was not used.  As mentioned previously,
interface variables are not used elsewhere in the program; thus, their only
possible use is in calculating output variables.  HotDrink can check to see if
these variables were, in fact, used this way.

An interface variable is said to be /contributing/ if, during the last time
the constraint system was updated, its value was used to calculate the value
of at least one output variable.  An interface variable is said to be
/relevant/ if editing it would have any effect on an output variable.  Every
contributing variable is automatically relevant; however, a non-contributing
variable can still be relevant if editing it would cause it to become
contributing.

Note that output variables are always both contributing and relevant.

