howto/async.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Requesting input promises</h3>
<div class="outline-text-3" id="text-5-2">
<p>
In some cases you may want your method to wait on all but one or two input
promises.  In such cases, you can request that the function lifting mechanism
pass to your function, not the <i>value</i> of the promise, but the promise itself.
This allows you to decide if and when you will wait on this promise.
</p>

<p>
The full signature of <code>liftFunction</code> is as follows.  Note that the last two
parameters are optional.
</p>

<div class="notes">
<p>
<code>liftFunction( fn, numOutputs, promiseMask )</code>
</p>
</div>

<p>
We explained the first two parameters in Section <a href="#sec-3">3</a>.  The
final parameter, if provided, should be an array of Boolean values, one for
each parameter, where <code>true</code> means to pass the corresponding parameter's
promise directly, and <code>false</code> means to wait for the corresponding parameter's
promise to resolve and pass its value.
</p>

<p>
However, as we mentioned earlier, there's really no reason to call
<code>liftFunction</code> directly; you should simply use the <code>method</code> builder member function
which calls <code>liftFunction</code> for you.  To indicate to the model builder that you
want to recieve a promise for a parameter, you place an asterisk ("<code>*</code>") in
front of the parameter name in the method signature.  You can see this in the
method declared in <a href="#coderef-asterisk"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-asterisk');" onmouseout="CodeHighlightOff(this, 'coderef-asterisk');">line 25</a> of the view-model.
</p>

<p>
If you decide you need this parameter, you must use it's <code>then</code> method to schedule a
function to be run when its value is ready.  On <a href="#coderef-then3"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-then3');" onmouseout="CodeHighlightOff(this, 'coderef-then3');">line 27</a> of the view-model
we schedule a function to calculate the total using the shipping cost as soon
as it is ready.  Remember that the return value for the <code>then</code> function is a
promise for the return value of the function we scheduled.  We return this
as the promise for the output of our method.
</p>

<p>
Observe what happens if the checkbox for <code>doship</code> is unchecked: Since <code>doship</code>
is false, we do not subscribe to the promise for <code>ship</code>.  Since we do not
subscribe to that promise, we do not have to wait for it to be ready.  Thus,
we can calculate the total cost before the shipping cost is even ready.  This is
convenient when the calculation for shipping cost is so slow.
</p>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Output variables</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Typically the purpose of a user interface is to allow the user to enter values
for variables that will be used elsewhere in the program &#x2014; e.g., in the
<i>model</i>.  (If you don't know what that is, see <a href="intro.html">Introduction to HotDrink</a>
for an explanation of MVVM.)  We refer to these variables as <i>output</i>
variables.
</p>

<p>
It is possible that a user interface contains some additional variables &#x2014;
variables which are not used elsewhere in the program, but are there to help
the user calculate other variables which are.  We refer to these variables as
<i>interface</i> variables.
</p>

<p>
By default, HotDrink considers all variables as interface variables.  If this
is not the case, then you will need to explicitly tell HotDrink which ones
are.  You can change a single variable to an output variable using the
<code>outputVariable</code> member function (abbreviated <code>ov</code>), or change a list of
variables to output variables using the <code>outputVariables</code> member function
(abbreviated <code>ovs</code>).  Similarly, you can change a single variable to an
interface variable using the <code>outputVariable</code> member function (abbreviated
<code>ov</code>), or change a list of variables to interface variables using the
<code>outputVariables</code> member function (abbreviated <code>ovs</code>).
</p>

<p>
The parameter for these functions is the name, or a comma-delimited list of
the names, to be changed.  For example:
</p>

<div class="org-src-container">

<pre class="src src-js">builder.outputVariable( <span style="color: #008000;">'x'</span> );

builder.interfaceVariables( <span style="color: #008000;">'x, y, z'</span> );
</pre>
</div>

<p>
As a convenience for you, these functions are overloaded so that, if there is
no variable with the name given, they will create one first.  Just as with the
<code>variable</code> and <code>variables</code> builder functions, you may specify an initial value
for the variables as well.  Thus, on <a href="#coderef-output"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-output');" onmouseout="CodeHighlightOff(this, 'coderef-output');">line 5</a> of the
view-model we both create a new variable named "output" and also mark the
variable as an output variable.
</p>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Contributing and relevant</h3>
<div class="outline-text-3" id="text-5-4">
<p>
There is another advantage to taking an input promise when you might not need
its value: HotDrink can tell if a promise was never subscribed to, and can
conclude that the corresponding input was not used.  As mentioned previously,
interface variables are not used elsewhere in the program; thus, their only
possible use is in calculating output variables.  HotDrink can check to see if
these variables were, in fact, used this way.
</p>

<p>
An interface variable is said to be <i>contributing</i> if, during the last time
the constraint system was updated, its value was used to calculate the value
of at least one output variable.  An interface variable is said to be
<i>relevant</i> if editing it would have any effect on an output variable.  Every
contributing variable is automatically relevant; however, a non-contributing
variable can still be relevant if editing it would cause it to become
contributing.
</p>

<p>
Note that output variables are always both contributing and relevant.
</p>
</div>
</div>
