docs/howto/async.org
** Automatic disabling

Every variable has two Boolean, read-only properties named /contributing/ and
a /relevant/ that report whether the variable is contributing and relevant, respectively.
HotDrink sets these properties; however, it does not use these properties for
anything.  The recommended use is to bind to them in the interface to give
useful information to the user.

In particular, the ~Enabled~ view adapter automatically disables a
user-interface element when the corresponding value is false.  In
[[(enable)][line (enable)]] of the view source, we use this binder to
automatically disable the state drop-down box whenever the corresponding
variable is irrelevant.

Note that the ~hd.enabled~ factory function creates an ~hd.Enabled~ binding
specification.  Also, the ~hd.*Var~ factories (~hd.editVar~, ~hd.numVar~,
etc.) add a ~hd.nabled~ binding to their specifications.  For more information
on binding specifications, see the [[file:binding.org][Advanced Binding
Concepts]] document.

Let's walk through what happens when the "Ship to" checkbox is unchecked.

- The ~doShip~ variable becomes false.

- The method on [[(asterisk)][line (asterisk)]] of the view-model is evaluated, causing
  function ~f3~ to be executed.

- Function ~f3~ does not subscribe to the promise for ~ship~.

- HotDrink notices that ~ship~ was not used, and is therefore
  non-contributing.

- Not only that, the method of ~f3~ is the /only/ possible way that ~ship~
  could affect an output variable --- and ~f3~ is currently not using ~ship~.

- HotDrink concludes that editing ~ship~ cannot affect an output variable, and
  is therefore irrelevant.

- The ~bindEnabled~ binding disables the drop-down box.

Note the assumption that HotDrink makes:  if a parameter is unused, then
changing it cannot make it become used.  That is certainly the case in
function ~f3~:  if ~doship~ is false, then it doesn't matter what value you give
~ship~ --- it's never going to be used.  The only way ~ship~ can be used is if
~doship~ changes.

What if you have a parameter that you only use in certain cases?  For example,
you use it if it's a positive number, but not if it's a negative number.  In
that case, you must subscribe to the promise in order to see the number so
that you can test whether it is positive or negative.  Since you subscribe to
the promise, HotDrink will consider it used.  This is consistent with our
definition of relevant:  the parameter is relevant because changing it could
potentially affect the output (i.e. if you changed it to a positive number).

** Explicit control over usage

HotDrink's default behavior is to consider a variable used if its promise was
subscribed to, and unused if it was not.  For most cases, that is reasonable
behavior.  However, it is possible that you might want to subscribe to a
parameter without committing to use its value, or to skip subscribing to a
promise but still treat it as being used.  In this case, you can explicitly
set the usage of a parameter using the following two functions.

- ~hd.markUsed( promise )~ marks a promise as being used, even if it was never
  subscribed to.

- ~hd.markUnused( promise )~ marks a promise as being unused, even if it was
  subscribed to.

* Helper: AJAX requests

