howto/async.html

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Automatic disabling</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Every variable has two Boolean, read-only properties named <i>contributing</i> and
a <i>relevant</i> that report whether the variable is contributing and relevant, respectively.
HotDrink sets these properties; however, it does not use these properties for
anything.  The recommended use is to bind to them in the interface to give
useful information to the user.
</p>

<p>
In particular, the <code>Enabled</code> view adapter automatically disables a
user-interface element when the corresponding value is false.  In
<a href="#coderef-enable"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-enable');" onmouseout="CodeHighlightOff(this, 'coderef-enable');">line 23</a> of the view source, we use this binder to
automatically disable the state drop-down box whenever the corresponding
variable is irrelevant.
</p>

<p>
Note that the <code>hd.enabled</code> factory function creates an <code>hd.Enabled</code> binding
specification.  Also, the <code>hd.*Var</code> factories (<code>hd.editVar</code>, <code>hd.numVar</code>,
etc.) add a <code>hd.nabled</code> binding to their specifications.  For more information
on binding specifications, see the <a href="binding.html">Advanced Binding
Concepts</a> document.
</p>

<p>
Let's walk through what happens when the "Ship to" checkbox is unchecked.
</p>

<ul class="org-ul">
<li>The <code>doShip</code> variable becomes false.
</li>

<li>The method on <a href="#coderef-asterisk"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-asterisk');" onmouseout="CodeHighlightOff(this, 'coderef-asterisk');">line 25</a> of the view-model is evaluated, causing
function <code>f3</code> to be executed.
</li>

<li>Function <code>f3</code> does not subscribe to the promise for <code>ship</code>.
</li>

<li>HotDrink notices that <code>ship</code> was not used, and is therefore
non-contributing.
</li>

<li>Not only that, the method of <code>f3</code> is the <i>only</i> possible way that <code>ship</code>
  could affect an output variable &#x2014; and <code>f3</code> is currently not using <code>ship</code>.
</li>

<li>HotDrink concludes that editing <code>ship</code> cannot affect an output variable, and
is therefore irrelevant.
</li>

<li>The <code>bindEnabled</code> binding disables the drop-down box.
</li>
</ul>

<p>
Note the assumption that HotDrink makes:  if a parameter is unused, then
changing it cannot make it become used.  That is certainly the case in
function <code>f3</code>:  if <code>doship</code> is false, then it doesn't matter what value you give
<code>ship</code> &#x2014; it's never going to be used.  The only way <code>ship</code> can be used is if
<code>doship</code> changes.
</p>

<p>
What if you have a parameter that you only use in certain cases?  For example,
you use it if it's a positive number, but not if it's a negative number.  In
that case, you must subscribe to the promise in order to see the number so
that you can test whether it is positive or negative.  Since you subscribe to
the promise, HotDrink will consider it used.  This is consistent with our
definition of relevant:  the parameter is relevant because changing it could
potentially affect the output (i.e. if you changed it to a positive number).
</p>
</div>
</div>

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> Explicit control over usage</h3>
<div class="outline-text-3" id="text-5-6">
<p>
HotDrink's default behavior is to consider a variable used if its promise was
subscribed to, and unused if it was not.  For most cases, that is reasonable
behavior.  However, it is possible that you might want to subscribe to a
parameter without committing to use its value, or to skip subscribing to a
promise but still treat it as being used.  In this case, you can explicitly
set the usage of a parameter using the following two functions.
</p>

<ul class="org-ul">
<li><code>hd.markUsed( promise )</code> marks a promise as being used, even if it was never
subscribed to.
</li>

<li><code>hd.markUnused( promise )</code> marks a promise as being unused, even if it was
subscribed to.
</li>
</ul>
</div>
</div>
</div>
