docs/howto/async.org
** The example

/View/

#+BEGIN_SRC html -n -r :exports code :tangle tangle/stocks.html :padline no
<table id="ex5" style="text-align:right">
  <style type="text/css" scoped>
    .pending { background: #eee right center no-repeat url(spinner.gif); }
    .noncontributing { background-color: #eee; }
  </style>
  <tr>
    <td>Symbol:</td>
    <td style="text-align:left">
      <select data-bind="hd.value( symbol ), hd.cssClass( symbol )">
        <option value="FB">Facebook</option>
        <option value="ADBE">Adobe</option>
        <option value="MS">Microsoft</option>
        <option value="YHOO">Yahoo!</option>
      </select>
    </td>
  </tr><tr>
    <td>Value:</td>
    <td><input type="text" data-bind="hd.numVar( value, 2 )"/></td>
  </tr><tr>
    <td>Quantity:</td>
    <td><input type="text" data-bind="hd.numVar( quantity, 0 )"/></td>
  </tr><tr>
    <td>Total:</td>
    <td><input type="text" data-bind="hd.numVar( total, 2 )"/></td>
  </tr>
</table>
#+END_SRC

/View-Model/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/stocks.js :padline no
function fetch_stock_value( symbol ) {
  var url = 'http://query.yahooapis.com/v1/public/yql';
  var params = {
    q: 'select * from yahoo.finance.quotes where symbol="' + symbol + '"',
    format: 'json',
    env: 'store://datatables.org/alltableswithkeys',
    callback: ''
  };
  return hd.ajaxJSON( url, params ).then( function( data ) {
    return Number( data.query.results.quote.LastTradePriceOnly );
  } );
}

var model = new hd.ModelBuilder()
  .vs( 'symbol, value, quantity', {symbol: 'ADBE', quantity: 10} )
  .ov( 'total' )

  .c( 'symbol, value' )
  .m( 'symbol -> value', fetch_stock_value )
  .m( 'symbol -> symbol', function( x ) { return x; } )

  .eq( 'total == value * quantity' )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
#+END_SRC

/Binding/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/stocks.js :padline no
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex5' ) );
} )
#+END_SRC

/Result/

#+HTML: <div class="results">
#+INCLUDE: tangle/stocks.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/stocks.js html
#+HTML: })();
#+HTML: </script>

/Notes/

#+HTML: <div class="notes">
This example uses a Yahoo! web service to look up the stock price for the given
symbol.  Selecting a new company results in a new stock price look up.  Note
that editing the stock price directly causes the drop-down list to be grayed
out, indicating that it is not being used.
#+HTML: </div>

** Simple AJAX wrappers

AJAX refers to the technique of using JavaScript to make an asynchronous HTTP
request to another server.  A full description of AJAX is beyond the scope of
this document, but many such descriptions can be found online.

There are many JavaScript frameworks which simplify the process of making an
AJAX request, allowing the programmer a great deal of control over how the
request is made and how the results of the request are processed.  HotDrink is
not one of those frameworks.  However, we would like to make it easy for you
to experiment with asynchronous methods that make AJAX requests, so we have
included a wrapper for simple AJAX requests.  If you need more control over
the request process, we recommend you look into other frameworks, or simply
write your own wrapper.

HotDrink provides the following functions.

