howto/async.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Helper: AJAX requests</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> The example</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<i>View</i>
</p>

<div class="org-src-container">

<pre class="src src-html"><span class="linenr"> 1: </span>&lt;<span style="color: #006699;">table</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex5"</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"text-align:right"</span>&gt;
<span class="linenr"> 2: </span>  &lt;<span style="color: #006699;">style</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/css"</span> scoped&gt;
<span class="linenr"> 3: </span>    .pending { background: #eee right center no-repeat url(spinner.gif); }
<span class="linenr"> 4: </span>    .noncontributing { background-color: #eee; }
<span class="linenr"> 5: </span>  &lt;/<span style="color: #006699;">style</span>&gt;
<span class="linenr"> 6: </span>  &lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr"> 7: </span>    &lt;<span style="color: #006699;">td</span>&gt;Symbol:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr"> 8: </span>    &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"text-align:left"</span>&gt;
<span class="linenr"> 9: </span>      &lt;<span style="color: #006699;">select</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.value( symbol ), hd.cssClass( symbol )"</span>&gt;
<span class="linenr">10: </span>        &lt;<span style="color: #006699;">option</span> <span style="color: #BA36A5;">value</span>=<span style="color: #008000;">"FB"</span>&gt;Facebook&lt;/<span style="color: #006699;">option</span>&gt;
<span class="linenr">11: </span>        &lt;<span style="color: #006699;">option</span> <span style="color: #BA36A5;">value</span>=<span style="color: #008000;">"ADBE"</span>&gt;Adobe&lt;/<span style="color: #006699;">option</span>&gt;
<span class="linenr">12: </span>        &lt;<span style="color: #006699;">option</span> <span style="color: #BA36A5;">value</span>=<span style="color: #008000;">"MS"</span>&gt;Microsoft&lt;/<span style="color: #006699;">option</span>&gt;
<span class="linenr">13: </span>        &lt;<span style="color: #006699;">option</span> <span style="color: #BA36A5;">value</span>=<span style="color: #008000;">"YHOO"</span>&gt;Yahoo!&lt;/<span style="color: #006699;">option</span>&gt;
<span class="linenr">14: </span>      &lt;/<span style="color: #006699;">select</span>&gt;
<span class="linenr">15: </span>    &lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">16: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">17: </span>    &lt;<span style="color: #006699;">td</span>&gt;Value:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">18: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( value, 2 )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">19: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">20: </span>    &lt;<span style="color: #006699;">td</span>&gt;Quantity:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">21: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( quantity, 0 )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">22: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">23: </span>    &lt;<span style="color: #006699;">td</span>&gt;Total:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">24: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( total, 2 )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">25: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;
<span class="linenr">26: </span>&lt;/<span style="color: #006699;">table</span>&gt;
</pre>
</div>

<p>
<i>View-Model</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #0000FF;">function</span> <span style="color: #006699;">fetch_stock_value</span>( <span style="color: #BA36A5;">symbol</span> ) {
<span class="linenr"> 2: </span>  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">url</span> = <span style="color: #008000;">'http://query.yahooapis.com/v1/public/yql'</span>;
<span class="linenr"> 3: </span>  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">params</span> = {
<span class="linenr"> 4: </span>    q: <span style="color: #008000;">'select * from yahoo.finance.quotes where symbol="'</span> + symbol + <span style="color: #008000;">'"'</span>,
<span class="linenr"> 5: </span>    format: <span style="color: #008000;">'json'</span>,
<span class="linenr"> 6: </span>    env: <span style="color: #008000;">'store://datatables.org/alltableswithkeys'</span>,
<span class="linenr"> 7: </span>    callback: <span style="color: #008000;">''</span>
<span class="linenr"> 8: </span>  };
<span class="linenr"> 9: </span>  <span style="color: #0000FF;">return</span> hd.ajaxJSON( url, params ).then( <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">data</span> ) {
<span class="linenr">10: </span>    <span style="color: #0000FF;">return</span> Number( data.query.results.quote.LastTradePriceOnly );
<span class="linenr">11: </span>  } );
<span class="linenr">12: </span>}
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
<span class="linenr">15: </span>  .vs( <span style="color: #008000;">'symbol, value, quantity'</span>, {symbol: <span style="color: #008000;">'ADBE'</span>, quantity: 10} )
<span class="linenr">16: </span>  .ov( <span style="color: #008000;">'total'</span> )
<span class="linenr">17: </span>
<span class="linenr">18: </span>  .c( <span style="color: #008000;">'symbol, value'</span> )
<span class="linenr">19: </span>  .m( <span style="color: #008000;">'symbol -&gt; value'</span>, fetch_stock_value )
<span class="linenr">20: </span>  .m( <span style="color: #008000;">'symbol -&gt; symbol'</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">x</span> ) { <span style="color: #0000FF;">return</span> x; } )
<span class="linenr">21: </span>
<span class="linenr">22: </span>  .eq( <span style="color: #008000;">'total == value * quantity'</span> )
<span class="linenr">23: </span>
<span class="linenr">24: </span>  .end();
<span class="linenr">25: </span>
<span class="linenr">26: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">system</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ConstraintSystem</span>();
<span class="linenr">27: </span>system.addComponent( model );
</pre>
</div>

<p>
<i>Binding</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">2: </span>  hd.performDeclaredBindings( model, document.getElementById( <span style="color: #008000;">'ex5'</span> ) );
<span class="linenr">3: </span>} )
</pre>
</div>

<p>
<i>Result</i>
</p>

<div class="results">
<table id="ex5" style="text-align:right">
  <style type="text/css" scoped>
    .pending { background: #eee right center no-repeat url(spinner.gif); }
    .noncontributing { background-color: #eee; }
  </style>
  <tr>
    <td>Symbol:</td>
    <td style="text-align:left">
      <select data-bind="hd.value( symbol ), hd.cssClass( symbol )">
        <option value="FB">Facebook</option>
        <option value="ADBE">Adobe</option>
        <option value="MS">Microsoft</option>
        <option value="YHOO">Yahoo!</option>
      </select>
    </td>
  </tr><tr>
    <td>Value:</td>
    <td><input type="text" data-bind="hd.numVar( value, 2 )"/></td>
  </tr><tr>
    <td>Quantity:</td>
    <td><input type="text" data-bind="hd.numVar( quantity, 0 )"/></td>
  </tr><tr>
    <td>Total:</td>
    <td><input type="text" data-bind="hd.numVar( total, 2 )"/></td>
  </tr>
</table>
</div>
<script type="text/javascript">
(function() {
function fetch_stock_value( symbol ) {
  var url = 'http://query.yahooapis.com/v1/public/yql';
  var params = {
    q: 'select * from yahoo.finance.quotes where symbol="' + symbol + '"',
    format: 'json',
    env: 'store://datatables.org/alltableswithkeys',
    callback: ''
  };
  return hd.ajaxJSON( url, params ).then( function( data ) {
    return Number( data.query.results.quote.LastTradePriceOnly );
  } );
}

var model = new hd.ModelBuilder()
  .vs( 'symbol, value, quantity', {symbol: 'ADBE', quantity: 10} )
  .ov( 'total' )

  .c( 'symbol, value' )
  .m( 'symbol -> value', fetch_stock_value )
  .m( 'symbol -> symbol', function( x ) { return x; } )

  .eq( 'total == value * quantity' )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex5' ) );
} )
})();
</script>

<p>
<i>Notes</i>
</p>

<div class="notes">
<p>
This example uses a Yahoo! web service to look up the stock price for the given
symbol.  Selecting a new company results in a new stock price look up.  Note
that editing the stock price directly causes the drop-down list to be grayed
out, indicating that it is not being used.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Simple AJAX wrappers</h3>
<div class="outline-text-3" id="text-6-2">
<p>
AJAX refers to the technique of using JavaScript to make an asynchronous HTTP
request to another server.  A full description of AJAX is beyond the scope of
this document, but many such descriptions can be found online.
</p>

<p>
There are many JavaScript frameworks which simplify the process of making an
AJAX request, allowing the programmer a great deal of control over how the
request is made and how the results of the request are processed.  HotDrink is
not one of those frameworks.  However, we would like to make it easy for you
to experiment with asynchronous methods that make AJAX requests, so we have
included a wrapper for simple AJAX requests.  If you need more control over
the request process, we recommend you look into other frameworks, or simply
write your own wrapper.
</p>

<p>
HotDrink provides the following functions.
</p>
</div>

<ol class="org-ol"><li><a id="sec-6-2-1"></a><code>ajax( url, params )</code><br  /><div class="outline-text-4" id="text-6-2-1">
<p>
