docs/howto/async.org
*** ~ajax( url, params )~

This function makes an asynchronous HTTP GET request to the provided URL.  If
provided, the ~params~ should be an object used as a map of parameters to be
included in the request; these will be added to the query string following
the GET request protocol.

The return value of this function is a promise which will be resolved with
the [[https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequest][~XMLHttpRequest~]] object once the request has been successfully completed.

*** ~ajaxXML( url, params )~

This function is identical to ~ajax~, except that the returned promise will be
resolved with the contents of the request as an XML DOM (i.e., the
~responseXML~ property of the ~XMLHttpRequest~ object).

*** ~ajaxText( url, params )~

This function is identical to ~ajax~, except that the returned promise will be
resolved with the contents of the request as a string (i.e. the
~responseText~ property of the ~XMLHttpRequest~ object).

*** ~ajaxJSON( url, params )~

This function is identical to ~ajax~, except that the returned promise will be
resolved with an object that is the result of parsing the contents of the
request as JSON.

* Helper: web workers

** The example

/View/

#+BEGIN_SRC html -n -r :exports code :tangle tangle/worker.html :padline no
<div id="ex6">
  <style type="text/css" scoped>
    .pending { background: #eee right center no-repeat url(spinner.gif); }
    .error { color: #900; }
  </style>
  <table style="text-align:right">
    <tr>
      <td>Start position:</td>
      <td><input type="text" data-bind="hd.numVar( start )"/></td>
      <td class="error" data-bind="hd.text( start.error )"></td>
    </tr><tr>
      <td>End position:</td>
      <td><input type="text" data-bind="hd.numVar( end )"/></td>
      <td class="error" data-bind="hd.text( end.error )"></td>
    </tr><tr>
      <td>Length:</td>
      <td><input type="text" data-bind="hd.numVar( length )"/></td>
      <td class="error" data-bind="hd.text( length.error )"></td>
    </tr>
  </table>
</div>
#+END_SRC

/View-Model/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/worker.js :padline no
var model = new hd.ModelBuilder()
  .vs( 'start, end, length', {start: 10, end: 25} )

  .c( 'start, end, length' )
  .m( 'start, length -> end', hd.worker( 'worker.js', 'slowSum' ) ) (ref:worker)
  .m( 'end, length -> start', hd.worker( 'worker.js', 'slowDiff' ) )
  .m( 'end, start -> length', hd.worker( 'worker.js', 'slowDiff' ) )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
#+END_SRC

/Binding/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/worker.js :padline no
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex6' ) );
} )
#+END_SRC

/Worker/  (file: worker.js)

#+BEGIN_SRC js -n -r :exports code :tangle publish/worker.js :padline no
importScripts( 'fn-worker.js' ); (ref:import)

function slowSum( a, b ) {
  var n;
  if (b < 0) {
    n = -1;
    b = -b;
  }
  else {
    n = 1;
  }
  for (var i = 0; i < b; ++i, ++n) {
    a += n - i;
  }
  return a;
}

function slowDiff( a, b ) {
  return slowSum( a, -b );
}
#+END_SRC

/Result/

#+HTML: <div class="results">
#+INCLUDE: tangle/worker.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/worker.js html
#+HTML: })();
#+HTML: </script>

/Notes/

#+HTML: <div class="notes">
This example uses an extremely poor algorithm for addition which is very
slow for large numbers.  (Try entering "1e9" for all values.)  Yet, because
the slow process is performed on a web worker with an asynchronous method, it
can never cause the interface to become unresponsive.
#+HTML: </div>

