howto/async.html
This function makes an asynchronous HTTP GET request to the provided URL.  If
provided, the <code>params</code> should be an object used as a map of parameters to be
included in the request; these will be added to the query string following
the GET request protocol.
</p>

<p>
The return value of this function is a promise which will be resolved with
the <a href="https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequest"><code>XMLHttpRequest</code></a> object once the request has been successfully completed.
</p>
</div>
</li>

<li><a id="sec-6-2-2"></a><code>ajaxXML( url, params )</code><br  /><div class="outline-text-4" id="text-6-2-2">
<p>
This function is identical to <code>ajax</code>, except that the returned promise will be
resolved with the contents of the request as an XML DOM (i.e., the
<code>responseXML</code> property of the <code>XMLHttpRequest</code> object).
</p>
</div>
</li>

<li><a id="sec-6-2-3"></a><code>ajaxText( url, params )</code><br  /><div class="outline-text-4" id="text-6-2-3">
<p>
This function is identical to <code>ajax</code>, except that the returned promise will be
resolved with the contents of the request as a string (i.e. the
<code>responseText</code> property of the <code>XMLHttpRequest</code> object).
</p>
</div>
</li>

<li><a id="sec-6-2-4"></a><code>ajaxJSON( url, params )</code><br  /><div class="outline-text-4" id="text-6-2-4">
<p>
This function is identical to <code>ajax</code>, except that the returned promise will be
resolved with an object that is the result of parsing the contents of the
request as JSON.
</p>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Helper: web workers</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> The example</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<i>View</i>
</p>

<div class="org-src-container">

<pre class="src src-html"><span class="linenr"> 1: </span>&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex6"</span>&gt;
<span class="linenr"> 2: </span>  &lt;<span style="color: #006699;">style</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/css"</span> scoped&gt;
<span class="linenr"> 3: </span>    .pending { background: #eee right center no-repeat url(spinner.gif); }
<span class="linenr"> 4: </span>    .error { color: #900; }
<span class="linenr"> 5: </span>  &lt;/<span style="color: #006699;">style</span>&gt;
<span class="linenr"> 6: </span>  &lt;<span style="color: #006699;">table</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"text-align:right"</span>&gt;
<span class="linenr"> 7: </span>    &lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr"> 8: </span>      &lt;<span style="color: #006699;">td</span>&gt;Start position:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr"> 9: </span>      &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( start )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">10: </span>      &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"error"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( start.error )"</span>&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">11: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">12: </span>      &lt;<span style="color: #006699;">td</span>&gt;End position:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">13: </span>      &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( end )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">14: </span>      &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"error"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( end.error )"</span>&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">15: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">16: </span>      &lt;<span style="color: #006699;">td</span>&gt;Length:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">17: </span>      &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( length )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">18: </span>      &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"error"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( length.error )"</span>&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">19: </span>    &lt;/<span style="color: #006699;">tr</span>&gt;
<span class="linenr">20: </span>  &lt;/<span style="color: #006699;">table</span>&gt;
<span class="linenr">21: </span>&lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<p>
<i>View-Model</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
<span class="linenr"> 2: </span>  .vs( <span style="color: #008000;">'start, end, length'</span>, {start: 10, end: 25} )
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>  .c( <span style="color: #008000;">'start, end, length'</span> )
<span id="coderef-worker" class="coderef-off"><span class="linenr"> 5: </span>  .m( <span style="color: #008000;">'start, length -&gt; end'</span>, hd.worker( <span style="color: #008000;">'worker.js'</span>, <span style="color: #008000;">'slowSum'</span> ) )</span>
<span class="linenr"> 6: </span>  .m( <span style="color: #008000;">'end, length -&gt; start'</span>, hd.worker( <span style="color: #008000;">'worker.js'</span>, <span style="color: #008000;">'slowDiff'</span> ) )
<span class="linenr"> 7: </span>  .m( <span style="color: #008000;">'end, start -&gt; length'</span>, hd.worker( <span style="color: #008000;">'worker.js'</span>, <span style="color: #008000;">'slowDiff'</span> ) )
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>  .end();
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">system</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ConstraintSystem</span>();
<span class="linenr">12: </span>system.addComponent( model );
</pre>
</div>

<p>
<i>Binding</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">2: </span>  hd.performDeclaredBindings( model, document.getElementById( <span style="color: #008000;">'ex6'</span> ) );
<span class="linenr">3: </span>} )
</pre>
</div>

<p>
<i>Worker</i>  (file: worker.js)
</p>

<div class="org-src-container">

<pre class="src src-js"><span id="coderef-import" class="coderef-off"><span class="linenr"> 1: </span>importScripts( <span style="color: #008000;">'fn-worker.js'</span> );</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #0000FF;">function</span> <span style="color: #006699;">slowSum</span>( <span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">b</span> ) {
<span class="linenr"> 4: </span>  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">n</span>;
<span class="linenr"> 5: </span>  <span style="color: #0000FF;">if</span> (b &lt; 0) {
<span class="linenr"> 6: </span>    n = -1;
<span class="linenr"> 7: </span>    b = -b;
<span class="linenr"> 8: </span>  }
<span class="linenr"> 9: </span>  <span style="color: #0000FF;">else</span> {
<span class="linenr">10: </span>    n = 1;
<span class="linenr">11: </span>  }
<span class="linenr">12: </span>  <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; b; ++i, ++n) {
<span class="linenr">13: </span>    a += n - i;
<span class="linenr">14: </span>  }
<span class="linenr">15: </span>  <span style="color: #0000FF;">return</span> a;
<span class="linenr">16: </span>}
<span class="linenr">17: </span>
<span class="linenr">18: </span><span style="color: #0000FF;">function</span> <span style="color: #006699;">slowDiff</span>( <span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">b</span> ) {
<span class="linenr">19: </span>  <span style="color: #0000FF;">return</span> slowSum( a, -b );
<span class="linenr">20: </span>}
</pre>
</div>

<p>
<i>Result</i>
</p>

<div class="results">
<div id="ex6">
  <style type="text/css" scoped>
    .pending { background: #eee right center no-repeat url(spinner.gif); }
    .error { color: #900; }
  </style>
  <table style="text-align:right">
    <tr>
      <td>Start position:</td>
      <td><input type="text" data-bind="hd.numVar( start )"/></td>
      <td class="error" data-bind="hd.text( start.error )"></td>
    </tr><tr>
      <td>End position:</td>
      <td><input type="text" data-bind="hd.numVar( end )"/></td>
      <td class="error" data-bind="hd.text( end.error )"></td>
    </tr><tr>
      <td>Length:</td>
      <td><input type="text" data-bind="hd.numVar( length )"/></td>
      <td class="error" data-bind="hd.text( length.error )"></td>
    </tr>
  </table>
</div>
</div>
<script type="text/javascript">
(function() {
var model = new hd.ModelBuilder()
  .vs( 'start, end, length', {start: 10, end: 25} )

  .c( 'start, end, length' )
  .m( 'start, length -> end', hd.worker( 'worker.js', 'slowSum' ) ) 
  .m( 'end, length -> start', hd.worker( 'worker.js', 'slowDiff' ) )
  .m( 'end, start -> length', hd.worker( 'worker.js', 'slowDiff' ) )

  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex6' ) );
} )
})();
</script>

<p>
<i>Notes</i>
</p>

<div class="notes">
<p>
This example uses an extremely poor algorithm for addition which is very
slow for large numbers.  (Try entering "1e9" for all values.)  Yet, because
the slow process is performed on a web worker with an asynchronous method, it
can never cause the interface to become unresponsive.
</p>
</div>
</div>
</div>
