docs/howto/async.org
** Simple web worker wrapper

A /web worker/ is a thread created by the web browser which can run JavaScript
code.  A web worker runs in parallel with the user-interface thread, meaning
it won't block the user interface, making it unresponsive.  As with AJAX, a
full description of web workers is beyond the scope of this document, and
readers are encouraged to look online for more information.

And, just as HotDrink is not a full-featured AJAX framework, neither is it a
full-featured web worker framework.  However, we would like to make it easy
for you to experiment with asynchronous methods run in web workers, so we have
included a wrapper for running functions on web workers.  If you need more
control over the process, we recommend you look into other frameworks, or
simply write your own wrapper.

To use HotDrink's wrapper requires two steps.

*** Place the JavaScript functions to be executed by the worker in a separate file.

As you can see on [[(import)][line (import)]] of the worker source, the first line of this
separate file should be this:

#+BEGIN_SRC js
importScripts( 'fn-worker.js' );
#+END_SRC

This line causes the JavaScript code in the file [[file:fn-worker.js][=fn-worker.js=]] to be included
in your web worker.  This file is included with HotDrink, and provides the
framework necessary for communication with the main thread.

Remember that the functions in your web worker will not have access to the
user interface, nor to any libraries being used in the main thread.  If you
want to use other JavaScript libraries, you will need to import them using the
~importScript~ function.

*** Use ~hd.worker~ to create a wrapper which will invoke the worker

The function ~hd.worker~ takes two string parameters: the URL for the file
containing the worker code, and the name of the function.  Note that the URL
may be relative to your main file.

The ~hd.worker~ function returns a new function which behaves as follows:
when called, it initiates a web worker to execute your function, passes the
parameters it received to the web worker, then returns a promise for the
result.  When the function on the web worker completes, its return value is
passed back to the main thread and then used to resolve the output promise.

This function is just right for use as a method; you can see it used as a
method on [[(worker)][line (worker)]] of the view-model source.

** Security restrictions

There are several security restrictions where the worker file must be located.
Again, a full description of web worker security is beyond the scope of this
document; in brief, the worker code must come from the [[https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy][same origin]] as your
main file.

Note, however, that most web browsers do not, by default, allow code from web
workers to come directly from the file system; thus, web workers require a web
server to work.

** Worker pools

We could create a new web worker for every method call; however, that would
introduce a lot of overhead.  Not only that, most browsers place a limit on
the number of web workers that can be running at one time.  At the other
extreme, we could create a single web worker and use it for every method call;
however, that requires waiting for one function to finish before initiating
the next.

The typical compromise to this dilemma is to create a /pool/ of workers.  When
a new method needs to be executed, we attempt to find an unused worker in the
pool.  If we find one, we use it to execute the method; if we cannot find one,
we wait until one becomes available.  This is the approach HotDrink takes.

HotDrink keeps a separate pool for each worker source file.  (So, in our
example, there is a single pool for the "~worker.js~" source file.)  Each pool
has a maximum number of allowable workers.  HotDrink creates a new worker only
when there are none available in the pool, and the pool has not yet reached is
maximum size.

The default maximum size for a worker pool is twenty --- that number seems to
work well with the browsers we tested on.  If you decide you would like to
change the maximum for a pool, you can use the ~hd.setMaxWorkers~ function to
do so.  This function takes two parameters: the source file for the pool to
modify, and the value for the new maximum.

In the example for this section, we could set the maximum number of web
workers spawned to three like so:

#+BEGIN_SRC js
hd.setMaxWorkers( 'worker.js', 3 )
#+END_SRC

** Killing workers

Sometimes the output of a method becomes irrelevant before it has even been
produced.  For example, suppose a method was scheduled to calculate the value
for a variable, but before it could complete, the user edited that variable
directly.  Now the output of the method no longer matters: it has been
replaced with the user's edit.

HotDrink can detect when these situations occur and react to them.  We will
save the full details of how this works for another document, but for now we
want to point out that, if the output of a method running on a web worker
becomes irrelevant, HotDrink's worker wrapper will kill the worker.

This behavior is necessary to ensure that the user interface will never become
unresponsive:  if we did not do this, then it would be possible for the worker
pool to become exhausted with web workers which were not returning but whose
output are no longer needed.

However, to suddenly kill a thread with no warning is generally considered to
be unsafe: the thread may have been in the middle of doing something important
and need to clean up before exiting.  If this is the case for your thread,
then you should not use the web worker wrapper provided with HotDrink; you
should write your own instead.  To do this, check out the Programming Guide.
