howto/async.html

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Simple web worker wrapper</h3>
<div class="outline-text-3" id="text-7-2">
<p>
A <i>web worker</i> is a thread created by the web browser which can run JavaScript
code.  A web worker runs in parallel with the user-interface thread, meaning
it won't block the user interface, making it unresponsive.  As with AJAX, a
full description of web workers is beyond the scope of this document, and
readers are encouraged to look online for more information.
</p>

<p>
And, just as HotDrink is not a full-featured AJAX framework, neither is it a
full-featured web worker framework.  However, we would like to make it easy
for you to experiment with asynchronous methods run in web workers, so we have
included a wrapper for running functions on web workers.  If you need more
control over the process, we recommend you look into other frameworks, or
simply write your own wrapper.
</p>

<p>
To use HotDrink's wrapper requires two steps.
</p>
</div>

<ol class="org-ol"><li><a id="sec-7-2-1"></a>Place the JavaScript functions to be executed by the worker in a separate file.<br  /><div class="outline-text-4" id="text-7-2-1">
<p>
As you can see on <a href="#coderef-import"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-import');" onmouseout="CodeHighlightOff(this, 'coderef-import');">line 1</a> of the worker source, the first line of this
separate file should be this:
</p>

<div class="org-src-container">

<pre class="src src-js">importScripts( <span style="color: #008000;">'fn-worker.js'</span> );
</pre>
</div>

<p>
This line causes the JavaScript code in the file <a href="fn-worker.js"><code>fn-worker.js</code></a> to be included
in your web worker.  This file is included with HotDrink, and provides the
framework necessary for communication with the main thread.
</p>

<p>
Remember that the functions in your web worker will not have access to the
user interface, nor to any libraries being used in the main thread.  If you
want to use other JavaScript libraries, you will need to import them using the
<code>importScript</code> function.
</p>
</div>
</li>

<li><a id="sec-7-2-2"></a>Use <code>hd.worker</code> to create a wrapper which will invoke the worker<br  /><div class="outline-text-4" id="text-7-2-2">
<p>
The function <code>hd.worker</code> takes two string parameters: the URL for the file
containing the worker code, and the name of the function.  Note that the URL
may be relative to your main file.
</p>

<p>
The <code>hd.worker</code> function returns a new function which behaves as follows:
when called, it initiates a web worker to execute your function, passes the
parameters it received to the web worker, then returns a promise for the
result.  When the function on the web worker completes, its return value is
passed back to the main thread and then used to resolve the output promise.
</p>

<p>
This function is just right for use as a method; you can see it used as a
method on <a href="#coderef-worker"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-worker');" onmouseout="CodeHighlightOff(this, 'coderef-worker');">line 5</a> of the view-model source.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Security restrictions</h3>
<div class="outline-text-3" id="text-7-3">
<p>
There are several security restrictions where the worker file must be located.
Again, a full description of web worker security is beyond the scope of this
document; in brief, the worker code must come from the <a href="https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy">same origin</a> as your
main file.
</p>

<p>
Note, however, that most web browsers do not, by default, allow code from web
workers to come directly from the file system; thus, web workers require a web
server to work.
</p>
</div>
</div>

<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> Worker pools</h3>
<div class="outline-text-3" id="text-7-4">
<p>
We could create a new web worker for every method call; however, that would
introduce a lot of overhead.  Not only that, most browsers place a limit on
the number of web workers that can be running at one time.  At the other
extreme, we could create a single web worker and use it for every method call;
however, that requires waiting for one function to finish before initiating
the next.
</p>

<p>
The typical compromise to this dilemma is to create a <i>pool</i> of workers.  When
a new method needs to be executed, we attempt to find an unused worker in the
pool.  If we find one, we use it to execute the method; if we cannot find one,
we wait until one becomes available.  This is the approach HotDrink takes.
</p>

<p>
HotDrink keeps a separate pool for each worker source file.  (So, in our
example, there is a single pool for the "<code>worker.js</code>" source file.)  Each pool
has a maximum number of allowable workers.  HotDrink creates a new worker only
when there are none available in the pool, and the pool has not yet reached is
maximum size.
</p>

<p>
The default maximum size for a worker pool is twenty &#x2014; that number seems to
work well with the browsers we tested on.  If you decide you would like to
change the maximum for a pool, you can use the <code>hd.setMaxWorkers</code> function to
do so.  This function takes two parameters: the source file for the pool to
modify, and the value for the new maximum.
</p>

<p>
In the example for this section, we could set the maximum number of web
workers spawned to three like so:
</p>

<div class="org-src-container">

<pre class="src src-js">hd.setMaxWorkers( <span style="color: #008000;">'worker.js'</span>, 3 )
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> Killing workers</h3>
<div class="outline-text-3" id="text-7-5">
<p>
Sometimes the output of a method becomes irrelevant before it has even been
produced.  For example, suppose a method was scheduled to calculate the value
for a variable, but before it could complete, the user edited that variable
directly.  Now the output of the method no longer matters: it has been
replaced with the user's edit.
</p>

<p>
HotDrink can detect when these situations occur and react to them.  We will
save the full details of how this works for another document, but for now we
want to point out that, if the output of a method running on a web worker
becomes irrelevant, HotDrink's worker wrapper will kill the worker.
</p>

<p>
This behavior is necessary to ensure that the user interface will never become
unresponsive:  if we did not do this, then it would be possible for the worker
pool to become exhausted with web workers which were not returning but whose
output are no longer needed.
</p>

<p>
However, to suddenly kill a thread with no warning is generally considered to
be unsafe: the thread may have been in the middle of doing something important
and need to clean up before exiting.  If this is the case for your thread,
then you should not use the web worker wrapper provided with HotDrink; you
should write your own instead.  To do this, check out the Programming Guide.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-10-29 Thu 10:02</p>
<p class="validation"></p>
</div>
</body>
</html>
